<?php

return array(

    'Balance after'=>'Баланс после',
    'Balance before'=>'Баланс до',
    'Bets'=>'Ставки',
    'Bonus coeff (Persent)'=>'Бонусный коеф. (Процент)',
    'Bonus pay period (Days)'=>'Период бонусной выплаты (Дни)',
    'Currency'=>'Валюта',
    'Diff last bet (Hours)'=>'Время с последней ставки (часы)',
    'Email'=>'Email',
    'Enable bonuses'=>'Включить бонусы',
    'Games statistic'=>'Статистика игр',
    'ID'=>'ID',
    'Lines'=>'Линии',
    'Offices'=>'Офисы',
    'Persons'=>'Персонал',
    'No'=>'Нет',
    'Yes'=>'Да',
    'Secret key (not required)'=>'Секретный ключ (не обязательно)',
    'RTP'=>'RTP (%)',
    'Secret key'=>'Секретный ключ',
    'Game statistic'=>'Статистика игр',
    'Date from'=>'Дата с',
    'Date to'=>'Дата по',
    'Office'=>'Клуб',
    'Test offices'=>'Тестовые клуюы',
    'Game'=>'Игра',
    'Find'=>'Поиск',
    'Clear'=>'Очистить',
    'Brand'=>'Бренд',
    'Date'=>'Дата',
    'Normal'=>'Обычная',
    'Double'=>'Удвоения',
    'In'=>'In',
    'Out'=>'Out',
    'Win'=>'Выигрыш',
    'Count'=>'Количество',
    'Visible name'=>'Видимое имя',
    'Person'=>'Персонал',
    'Enable telegram when login'=>'Запрашивать код в телеграм при входе',
    'Name'=>'Имя',
    'Login'=>'Логин',
    'Role'=>'Роль',

    'New Office'=>'Новый клуб',
    'Balance report'=>'Отчет по балансам',
    'Manuals'=>'Инструкции',
    'Office report'=>'Отчет по клубам',
    'Who'=>'Кто',
    'Object'=>'Объект',
    'Amount'=>'Сумма',
    'Comment'=>'Комментарий',
    'Only my'=>'Только мои',

    'Success!'=>'Успешно!',
    'Your message has been sent.'=>'Выше сообщение было отправлено.',


    'Name'=>'Имя',
    'Subject'=>'Тема',
    'Message'=>'Сообщение',
    'Send Message'=>'Отправить сообщение',
    'Our Contacts'=>'Наши контакты',
    'Contact Form'=>'Свяжитесь с нами',
    'From'=>'с',
    'To'=>'по',
    'All'=>'Все',
    'Replenish'=>'Пополнить',
    'Take off'=>'Забрать',
    'Total'=>'Итого',
    'Amount'=>'Баланс',
    'Password'=>'Пароль',
    'Is test'=>'Тестовые',

    'Please place your bet' => 'Пожалуйста, делайте Ваши ставки',
    'Good luck' => 'Удачи',
    'Line' => 'Линия',
    'Scatter' => 'Scatter',
    'Please gamble or take win' => 'Удваивайте или заберите выигрыш',
    'Select cards to hold' => 'Выберите карты для удержания',
    'Please select symbol' => 'Пожалуйста, выберите символ',
    'free games left' => 'бонусных игр осталось',
    'not enough credits' => 'недостаточный баланс',
    'Play sounds?' => 'Играть со звуком?',
    'Yes' => 'Да',
    'No' => 'Нет',
    'BALANCE' => 'БАЛАНС',
    'LAST WIN' => 'ПОСЛЕДНИЙ ВЫИГРЫШ',
    'gamble_button' => 'УДВОИТЬ',
    'auto_button' => 'АВТО',
    'bet_button' => 'СТАВКА',
    'total_bet' => 'СТАВКА',
    'start_button' => 'СТАРТ',
    'STOP ALL' => 'ОСТАНОВИТЬ',
    'COLLECT' => 'ЗАБРАТЬ',
    'INFO' => 'ИНФО',
    'lines' => 'линий',
    'lines2' => 'линии',
    'Random' => 'Случайно',
    'Odd'=>'Нечет.',
    'Even'=>'Чет.',
    'Top'=>'Топ',
    'Middle'=>'Середина',
    'Bottom'=>'Низ',
    'Payout'=>'Выплаты',
    'Pay table'=>'Таблица выплат',
    'Hits'=>'Совпадения',
    'Fixed' => 'Фикс.',
    'STOP'."\n".'AUTO' => 'СТОП'."\n".'АВТО',
    'CLOSE'. "\n" .'INFO' => 'ЗАКР.'."\n".'ИНФО',
    'next_button' => 'ДАЛЕЕ',
    'Current WIN' => 'Текущий ВЫИГРЫШ',
    'Gamble X2 to WIN' => 'ВЫИГРЫШ после удвоения',
    'Gamble X4 to WIN' => 'ВЫИГРЫШ после учетверения',
    'X2 to WIN' => 'ВЫИГРЫШ X2',
    'X4 to WIN' => 'ВЫИГРЫШ X4',
    'Gamble X4 to WIN' => 'ВЫИГРЫШ после учетверения',
    'Statistics' => 'Статистика',
    'Substitutes for all' . "\n" . 'symbols except ' . 'scatters' . "\n" . 'on the same reel' => 'Заменяет все
символы кроме
scatters на том же барабане',
    'gamble_rules' => 'Для удвоения любого выигрыша нажмите на кнопку УДВОИТЬ,
затем нажмите на кнопки RED, BLACK или выберите МАСТЬ.
Если цвет RED/BLACK угадан правильно, выигрыш увеличивается вдвое (х2).
Если МАСТЬ угадана верно, выигрыш увеличивается вчетверо (х4).
При неудачном выборе - весь текущий выигрыш сгорает и игра заканчивается.',
        'GAMBLE' => 'УДВОЕНИЕ',
        'NEXT' => 'ДАЛЕЕ',
        'poker_rules' => 'это видео покер, в который играют одной колодой карт (52 карты). Игра состоит из двух раундов. Раздаются пять карт. В конце первого раунда игрок может выбрать, какие карты нужно удержать. После первого раунда игроку будет предложено выбрать карты, которые ему лучше всего удержать. Такие карты автоматически удерживаются. Игрок может отменить выбор этих карт и пометить разные по своему желанию. Остальные карты "утилизируются". Второй раунд начинается после выбора карт, которые будут удержаны. "Утилизированные" карты заменяются другими картами из колоды. Если есть выигрышная комбинация, в конце второго раунда игрок выигрывает эту сумму. Неисправность аннулирует все выплаты и игры.',
        'Substitutes for all' . "\n" . 'symbols except' ."\n" . 'scatters'=>'Заменяет все
символы кроме
scatters',
        'Substitutes' . "\n" . 'for all symbols except'=>'Заменяет все
символы кроме',
        'keno_rules'=>'Игрок может делать ставки, выбирая номера в диапазоне от 1 до 80. Игрок может выбрать от 1 до 10 номеров. После того, как игрок сделал ставку, 20 чисел выпадают в случайном порядке Выигрыш рассчитывается в соответствии с таблицей выплат в зависимости от выбранных игроком номеров и совпадений между выпавшими номерами и выбранными номерами. Неисправность аннулирует все выплаты и игры.',
        'Doubles win when substituting'=>'Удваивает выигрыш при замене',
        'All pays are left to right on adjacent reels, on selected lines, beginning with the leftmost reel, except scatters. Scatter wins are added to the payline wins. Highest payline add/or scatter wins only paid. Line wins are multiplied by the bet value on the winning line. Scatter wins are multiplied by the total bet value. Malfunction voids all pays and plays.'=>'Все выплаты слева направо на соседних барабанах, на выбранных линиях, начиная с самого левого барабана, кроме Scatters. Выигрыши Scatter добавляются к выигрышам на линии выплат. Выплачиваются наибольшие выплаты по линиям или Scatters только. Выигрыши по линиям умножаются на значение ставки на выигрышной линии. Выигрыши Scatter умножаются на общее значение ставки. Неисправность аннулирует все выплаты и игры.',
        'All pays are left to right on adjacent reels, on selected lines, beginning with the leftmost reel. Highest payline wins only paid. Line wins are multiplied by the bet value on the winning line. Malfunction voids all pays and plays.'=>'Все выплаты слева направо на соседних барабанах, на выбранных линиях, начиная с самого левого барабана. Выплачиваются наибольшие выплаты по линиям. Выигрыши по линиям умножаются на значение ставки на выигрышной линии. Неисправность аннулирует все выплаты и игры.',
        'paylines_and_rules'=>'ПРАВИЛА И ВЫПЛАТЫ',
        'Substitutes for all' . "\n" . 'symbols except ' . 'scatters' . "\n" . 'on the same reel' => 'Заменяет все символы' . "\n" . 'на том же барабане' ."\n". 'кроме scatters',
        'Substitutes for all' . "\n" . 'symbols on the same reel' . "\n" . ' except             and    ' => 'Заменяет все символы ' ."\n".'на том же барабане'."\n".' кроме              и',

        'Substitutes' . "\n" . 'for all symbols' . "\n" . 'on the same reel' . "\n". "\n" . ' except         and               '=>
                                                'Заменяет' ."\n".'все символы ' ."\n".'на том же'. "\n" .'барабане'."\n".' кроме           и               ',

        'fg_won'=>'Выиграно {%n}'."\n".'бонусных игр',
        'fg_won_more'=>'Выиграно еще {%n}'."\n".'бонусных игр',
        'substitutes_single'=>'ЗАМЕНЯЕТ' . "\n" . 'все символы',
        'fg'=>'БОНУСНЫХ ИГР',
        'fg2'=>'БОНУСНЫЕ ИГРЫ',
        'fg3'=>'ЗАПУСКАЕМ БОНУСНУЮ ИГРУ',
        'During free games, payouts are multiplied by x'=>'Во время бесплатных игр выплаты умножаются на ',
        'won'=>'выиграно',
        'Stretches on all neighboring positions' => 'Растягивается на все соседние позиции',
        'Stretches on all neighboring positions.' . "\n" . 'Substitutes for all symbols except        ' => 'Растягивается на все' . "\n" . 'соседние позиции.' . "\n" . 'Заменяет все символы, кроме    ',
        'x2 when substitutes' => 'x2 при замене',
        '10 to 12 scatters' . "\n" . 'trigger freegames'=>'От 10 до 12 скаттеров' . "\n" . 'запускают' . "\n" . 'бесплатные игры.',
        'substituting'=>'заменой',
        '20 free games'."\n".'with'=>'20 бонусных'."\n".'игр с',
        'SUBTITUTES for ALL symbols except scatters'=>'Заменяет ВСЕ символы, кроме scatters',
        'One or more subtituting in win combination'."\n".'DOUBLES the prize.'=>'Заменяет символы в выигрышной'."\n".'комбинации и УДВАИВАЕТ выигрыш',
        '3 or more scatters on the screen trigger'."\n".'15 free Games.'=>'3 и более scatters дают'."\n".'15 бонусных игр',

        'During free games prizes are multiplied by 3.'."\n".
        'Free Games can be won again during the Free Games.'."\n".
        'Free games are played at trigger bet and lines.' =>            'Во время бонусных игр выигрыш умножается на 3.'."\n".
                                                                        'Могут выпасть дополнительные бонусные игры'."\n".
                                                                        'Бонусные игры играются по триггерной '."\n".'ставке и линиям.',

        'Hold for'."\n".'autospin'=>'Удерживать'."\n".'для автоигры',
        'MENU'=>'МЕНЮ',
        'CLOSE'."\n".'MENU'=>'ЗАКР.'."\n".'МЕНЮ',
        '15 of a kind from'=>'     15 одинаковых',
        '12 of a kind from'=>'     12 одинаковых',
        '9 of a kind from'=>'     9 одинаковых',
        'or'=>'или',
        'on all reels,'=>'на всех барабанах,',
        'multiplies the TOTAL GAME WIN by'=>'           умножает ОБЩИЙ ВЫИГРЫШ на',
        'on 1st, 2nd, 3rd and 4th reels,'=>'на 1ом, 2ом, 3ем и 4ом барабанах,',
        'on 1st, 2nd and 3rd reels,'=>'на 1ом, 2ом и 3ем барабанах,',
        'Congratulations! You WIN!'."\n".'slow network...'."\n".'please, wait'=>'Поздравляем!'."\n".'Вы выиграли!'."\n".'Медленное подключение'."\n".'к интернету, ожидайте',
        'Last cards'=>'История карт',
        'Gamble to WIN'=>'После удвоения',


        //royal
        'Ace, King, Queen, Jack and Ten all the same suit'=>'Туз, Король, Дама, Валет и Десять одинаковой масти',
        //four
        'All four cards of the Aces'=>'Все четыре Туза',
        //Straight Flush
        'Any five card sequence in the same suit'=>'Любые карты по порядку одинаковой масти',
        //Four faces
        'All four cards of the Kings, Queens or Jacks'=>'Четыре Короля, Четыре Дамы или четыре Вальта',
        //Four 2s through 10s
        'All four cards of the same rank of Tens or lower'=>'Все четыре карты одного достоинства от десяти и младше',
        //Full house
        'Three of a kind combined with a pair'=>'Три карты одного достоинства и две карты другого',
        //Flush
        'Any five cards of the same suit, but not in sequence'=>'Любые пять карт одной масти, но не по порядку',
        //Straight
        'Five cards in sequence, but not in the same suit'=>'Пять карт по порядку, но разных мастей',
        //Three
        'Three cards of the same rank'=>'Три карты одного достоинства',
        //Two pairs
        'Two separate pairs'=>'Две различные пары',
        //Jacks or Better
        'Two cards of the same rank of Jacks or better'=>'Две карты одного достоинства Вальтов и старше',
        'Two cards of the same rank of Tens or better'=>'Две карты одного достоинства десяток и старше',
        'All four cards of the same rank'=>'Четыре карты одного достоинства',



        'Hand rankings'=>'Комбинации',
        'hands'=>'руки',


        'jpinfo' => 'Откройте 7 карт и выиграйте один из четырех джекпотов, в соответствии с выигрышной покерной комбинацией. Если комбинация - Royal Flush, то выигрывают сразу все джекпоты. Когда джекпоты мигают, любая ставка может привести к выигрышу джекпота. ',
        'fs_header'=>'Поздравляем',
        'fs_text1'=>'Заберите',
        'Game'=>'Игра',
        'fs_rules'=>'Daily Spins (DS) рассчитываются как сумма всех отыгранных средств в играх AGT software, кроме покера и кено, с момента предыдущего начисления, но не более чем за 10 дней,
            минус сумма всех выигрышей за тот же период, умноженная на коэффициент DS.

            Коэффициент DS для новых игроков составляет 4,5%. Коэффициент DS увеличивается на 0,5% каждый день, если игрок делает ставки в играх, кроме покера и кено в этот день
            и уменьшается на 1%, если игрок не делает ставок на игры, кроме покера и кено.
            Коэффициент DS не может быть меньше 4,5% и больше 10%.

            DS начисляется в момент входа в игру, если с момента последней ставки прошло 8 часов.
            День считается по часовому поясу UTC.

            После принятия DS необходимо отыграть в течение 20 минут.',
        'total_win'=>'ОБЩИЙ ВЫИГРЫШ',

        //deepl
        'Make your first bet to start receive Daily Spins cashback!' => 'Сделайте свою первую ставку, чтобы начать получать кэшбэк Daily Spins!',
        'You made bets for %d credits'=>'Сумма сделанных ставок - %d кредитов',
        'No.'=>'#',
        'Change'=>'Изменение',
        'Value'=>'Значение',
        'Time left'=>'Осталось времени',
        'Status'=>'Статус',
        'Type'=>'Тип',
        'In'=>'In',
        'Out'=>'Out',
        'Coef.'=>'Коэф.',
        'Balance'=>'Баланс',
        'Lines'=>'Линии',
        'Expiration'=>'Истекает',

        'Information is updated every 10 minutes'=>'Информация обновляется каждые 10 минут',
        'Your cashback rate is'=>'Процент кешбека',
        'Daily Spins forecast'=>'Прогноз Daily Spins',
        'Total free spins'=>'Всего фриспинов',

        'Play every day and get Daily Spins (DS)'=>'Играйте каждый день и получайте Daily Spins (DS)',
        'Your current Daily Spins cashback coefficient is'=>'Текущий процент кешбека Daily Spins',
        'Play and get +0.5% for every day up to 10%'=>'Играйте и получайте +0,5% за каждый день до 10%',
        'To recieve DS cashback you should go to any game'=>'Для получения DS необходимо зайти в любую игру',
        'Last bet time'=>'Время последней ставки',
        'Last update'=>'Последнее обновление',
        'Next update'=>'Следующее обновление',
        'AWARDED / DECLINED DAILY SPINS HISTORY'=>'ИСТОРИЯ НАЧИСЛЕННЫХ/ОТМЕНЁННЫХ DS',
        'Daily Spins (DS) are calculated as follows: the sum of all wagered funds in AGT software games, except for poker and keno games, from the moment of the previous accrual (up to a maximum of 10 days), minus the sum of all winnings for the same period multiplied by the DS coefficient. The DS coefficient for new players is 4.5%. The DS coefficient increases by 0.5% every day if the player bets on games, except for poker and keno games, on that day. If the player does not bet on any games, except for poker and keno games, the DS coefficient decreases by 1%. The DS coefficient cannot be less than 4.5% or more than 10%.

DS is credited at the moment of entering the game if 8 hours have passed since the last bet. The day is considered in the UTC time zone. After accepting DS, it must be played within 20 minutes to be eligible for rewards.'=>'Daily Spins (DS) рассчитываются следующим образом: сумма всех отыгранных средств в играх AGT software, кроме покера и кено, с момента предыдущего начисления (максимум за 10 дней), минус сумма всех выигрышей за тот же период, умноженная на коэффициент DS. Коэффициент DS для новых игроков составляет 4,5%. Коэффициент DS увеличивается на 0,5% каждый день, если игрок делает в этот день ставки в играх, за исключением покера и кено. Если игрок не делает ставок ни в каких играх, кроме покера и кено, то коэффициент DS уменьшается на 1%. Коэффициент DS не может быть меньше 4,5% или больше 10%.

DS начисляется в момент входа в игру, если с момента последней ставки прошло 8 часов. Сутки считаются в часовом поясе UTC. После зачисления DS для получения вознаграждения его необходимо отыграть в течение 20 минут.',

        'You can choose animation later inside menu'=>'Вы можете поменять анимацию потом в меню',
        'Make your bet before the flight begins'=>'Делайте ставку, пока не начался полет',
        'Take a risk and wait for odds to go high'=>'Рискуйте и ждите более высокого коэффициента',
        'Cash out before it flies away'=>'Успейте забрать выигрыш до того, как улетит',

        'You have an option to place two or three bets on the same flight by clicking the plus button.'=>'Вы можете одновременно сделать от 1 до 3 ставок на один полет нажав на "+".',
        'Each bet can be set manually or use auto for a pre-setted bet and collect multiplier.'=>'Каждая ставка настраиваейтся отдельно, либо можно использовать настройки по умолчанию',
        '"Auto bet" and "auto cash out out" functions activate after marking when a new round start.'=>'"Авто-ставка" и "Авто-выигрыш" активируются когда начинается новый раунд',
        'If the internet connection is interrupted when the bet is active, the game will automatically cash out with the current multiplier, and the winning amount will be added to your balance.'=>'Если соединение с интернетом прерывается, при этом ставка сделана, но разыграна, то ставка автоматически разыгрывается с коэффициентом на момент разрыва.',
        'The winnings are rounded down to 2 digits after the point.'=>'Выигрыш округляется до двух знаков после запятой.',
        'The maximum winnings is {%n}. The game will will be automatically cash out when this value is reached.'=>'Максимальный выигрыш {%n}. По достижении выигрыша этого значения, будет произведен "Авто-выигрыш"',
        'The minimum stake is {%n}.'=>'Минимальная ставка {%n}.',
        'The maximum stake is {%n}.'=>'Максимальная ставка {%n}.',
        'Malfunction voids all pays and plays.'=>'Неисправность аннулирует все выплаты и игры.',

        'How to play' => 'Как играть',
        'Animation' => 'Анимация',
        'Music' => 'Музыка',
        'Off' => 'Выключить',
        'Sounds' => 'Звуки',
        'Close game' => 'Закрыть игру',
        'All bets' => 'Все ставки',
        'My bets' => 'Мои ставки',
        'User' => 'Игрок',
        'Bet' => 'Ставка',
        'multiplier' => 'Коэф.',
        'Cash out' => 'Получить выигрыш',
        'Auto cash out' => 'Авто выигрыш',
        'You won' => 'Вы выиграли',
        'Top wins' => 'Топ выигрышей',
        'Top rates' => 'Топ коэф.',
        'Day' => 'День',
        'Month' => 'Месяц',
        'Year' => 'Год',
        'Date' => 'Дата',
        'Win' => 'Выигрыш',
        'Rate' => 'Коэф.',
        'Send' => 'Отправить',
        'Message text' => 'Текст сообщения',
        'Cancel bet'=>'Отменить ставку',
        'Wait'=>'Ожидайте',
        'Start auto bet'=>'Авто-ставка',
        'Cancel bet and stop auto bet'=>'Отменить ставку и остановить авто-ставку',
        'Stop auto bet'=>'Остановить авто-ставку',
        'Bet now'=>'Делайте ставку',
        'Wait for next round'=>'Ожидайте начала следующего раунда',
        'Switch off auto cash first'=>'Сначала выключите автоматическое получение выигрыша',
        'Cancel bet or take win'=>'Отмените ставку или возьмите выигрыш',
        'roshambo_rules'=>'Игра имеет три возможных исхода: ничья, выигрыш или проигрыш. Игрок, решивший играть камнем, выиграет у другого игрока, выбравшего ножницы, но проиграет тому, кто играл бумагой; игрок, играющий бумагой, проиграет игроку, играющему ножницами. Если игроки выбирают одинаковую форму или нет игрока, которого никто не обыграл, результат игры - ничья. Если выигрывает только один игрок, то это абсолютная победа. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules'=>'Игровое поле - разрезанные на 16 кусочков четыре картины Вангога. Размер выигрыша зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules1'=>'Игровое поле - разрезанные на 16 кусочков четыре картины Хокусая. Размер выигрыша зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules2'=>'Игровое поле - разрезанные на 16 кусочков пять картин Климта. Размер выигрыша зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules3'=>'Игровое поле - разрезанные на 9 кусочков четыре картины Мунка. Размер выигрыша зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules4'=>'Игровое поле - разрезанные на 9 кусочков три картины Вермеера. Размер выигрыша зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules5'=>'Игровое поле представляет собой пять картин Клода Моне, разрезанные на 4 части. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules6'=>'Игровое поле представляет собой три картины Питера Пауля Рубенса, разрезанные на 4 части. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры..',
        'shuffle_rules7'=>'Игровое поле представляет собой три картины Пьера Огюста Ренуара, разрезанные на 6 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules8'=>'Игровое поле представляет собой три картины Рембрандта ван Рейна, разрезанные на 6 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules9'=>'Игровое поле представляет собой две картины Микеланджело Буонарроти, разрезанные на 4 части. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules10'=>'Игровое поле представляет собой три картины Эдуарда Мане, разрезанные на 12 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules11'=>'Игровое поле представляет собой три картины Иеронима Босха, разрезанные на 9 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules12'=>'Игровое поле представляет собой три картины Поля Сезанна, разрезанные на 12 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',
        'shuffle_rules13'=>'Игровое поле представляет собой три картины Поля Гогена, разрезанные на 6 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',

        //ematrix
        'TokenNotFound'=>'Сессия завершилась. Пожалуйста, откройте игру заново, чтобы продолжить игру',
        'CasinoLossLimit'=>'Эта ставка превысит ваше ограничение. Пожалуйста, попробуйте сыграть на меньшую сумму или измените лимит ставок',

        'promo_start'=>'Начало',
        'promo_end'=>'Окончание',
        'promo_everyday'=>'Каждый день',
        'Every Friday'=>'Каждую Пятницу',
        'promo_black_friday'=>'Акция "Чёрная пятница"',
        'promo_maxrefund'=>'Максимальный возврат',
        'promo_title'=>'Акция',
        'promo_end_title'=>'Акция завершена',
        'promo_summary'=>'Ваш возврат составляет',
        'promo_rule'=>'В акции учавствуют все игры site-domain, кроме видеопокера. Все средства, проигранные в ходе акции возвращаются, но не более суммы максимального возрата. Для получения возврата необходимо зайти в любую игру site-domain, кроме ToTheMoon и видеопокера после :date1, но не позднее :date2',

        'fg3'=>'Старт бонусной игры',

        'fg_stop_rule'=>'Бонусная игра завершается, когда выпадает символ WASTED на 1 и 5 барабане',
        'fg_start_rule'=>'Бонусная игра начинается, когда выпадает символ SCATTER на 1 и 5 барабане',
        'start_fg'=>'Начинают бонусную игру',
        'end_fg'=>'Заканчивают бонусную игру',
        'buy_bonus'=>'купить бонус',
        'buy_bonus_game'=>'Купить бонусную игру',
        'price'=>'Стоимость',

        'Every day'=>'Каждый день',
        'Every Monday'=>'Каждый Понедельник',
        'Every Friday,Saturday,Sunday'=>'Каждую Пятницу,Субботу,Воскресенье',

        'pedro_rules'=>'Все выплаты происходят при выпадении четырех одинаковых символов. Неисправность аннулирует все выплаты игры.',

        'trigger_fg_with_count' => 'Запускает {%n} бесплатных игр',

    'shuffle_rules5' => 'Игровое поле - пять картинок Клода Моне, разрезанные на 4 части. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',

    'shuffle_rules11' => 'Игровое поле - две картинки от Hieronymus Bosch, разрезанные на 9 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',

    'shuffle_rules12' => 'Игровое поле - четыре картины Пола Сезанна, разрезанные на 12 частей. Выигрыш зависит от количества кусочков одной картины на игровом поле. Неисправность аннулирует все выплаты и игры.',

    'maxlines_rules' => 'Выигрыши формируются за комбинации из соседних символов любого размера слева направо. Барабаны с 1 по 6 могут содержать от 2 до 7 символов. В общей сложности, максимальное количество возможных способов выиграть составляет 117649. Совпадающие выигрыши на разных способах ставок суммируются. Выплаты производятся в соответствии с таблицей выплат. Выигрыши умножаются на ставку на каждый способ выплаты, за исключением символов Scatter. Если несколько выигрышных комбинаций появляются на одном игровом поле, оплачивается только самая высокая комбинация. Неисправность аннулирует все выплаты и игры.',

    'anywhere_10_fg' => 'В любом месте на экране запускает 10 бесплатных игр',

    'substitutes_shiningstars' => 'Заменяет
все символы
на одном барабане
 кроме зеленой и 
 фиолетовой звезды',

    'substitutes_applesshine' => 'Заменяет
все символы
на одном барабане
 кроме желтого 
 и зеленого яблока',

    'or_more' => 'или больше',

    'aero_rule_title' => 'Как играть',
    'aero_rule1' => 'Ставки перед взлетом;',
    'aero_rule2' => 'Посмотрите, как ваш самолет взлетает, и ваш выигрыш увеличивается;',
    'aero_rule3' => 'Надпись до того, как самолет улетает и выигрывает X раз больше!',
    'aero_rule4' => 'Но помните, что если у вас не было времени, чтобы заработать до того, как самолет улетит, ваша ставка будет потеряна. Aerobet - это чистое волнение! Риск и победа. Это все в твоих руках!',
    'aero_rule5' => 'Множитель победы начинается в 1x и растет все больше и больше, когда самолет взлетает.',
    'aero_rule6' => 'Ваши выигрыши рассчитываются у множителя, при котором вы заработали деньги, умноженные на вашу ставку.',
    'aero_rule7' => 'Перед началом каждого раунда наш докатически справедливый генератор случайных чисел генерирует множитель, при котором плоскость улетит.',
    'aero_rule8' => 'Выберите сумму и нажмите кнопку «Ставка», чтобы сделать ставку.',
    'aero_rule9' => 'Вы можете отменить ставку, нажав кнопку «Отмена», если раунд еще не начался.',
    'aero_rule10' => 'Отрегулируйте размер ставки, используя кнопки «-» и «+», чтобы изменить сумму ставки. В качестве альтернативы, вы можете выбрать размер ставки, используя предустановленные значения или ввести значение вручную.',
    'aero_rule11' => 'Вы можете сделать две ставки одновременно.',
    'aero_rule12' => 'Нажмите кнопку «Налиться», чтобы обналичить свои выигрыши. Ваша победа - это ваша ставка, умноженная на множитель наличных.',
    'aero_rule13' => 'Ваша ставка потеряна, если вы не заработали, прежде чем самолет улетает.',
    'aero_rule14' => 'Перед началом автоматической игры выберите размер ставки, с которым вы хотите сыграть. Как это сделать, описано в разделе Bet & Cash Out.',
    'aero_rule15' => 'Auto Play активируется с вкладки «Авто» на панели ставок, нажав кнопку «Автопогра».',
    'aero_rule16' => 'Auto Cash Out доступен на вкладке «Авто» на панели ставок. После активации ваша ставка будет автоматически обнаружена, когда она достигнет введенного множителя.',
    'aero_rule17' => 'Вы можете остановить автоматическое воспроизведение, нажав кнопку «Стоп».',
    'aero_rule18' => 'На этой панели вы можете увидеть все ставки, сделанные в текущем раунде.',
    'aero_rule19' => 'На панели «Мои ставки» вы можете увидеть все свои ставки и информацию.',
    'aero_rule20' => 'На панели «верхняя» статистика игры расположена. Вы можете просматривать победы по сумме или выработать множитель, и увидеть самые большие круглые множители.',
    'aero_rule21' => 'Мультипликатор для каждого раунда генерируется доказуемо справедливым алгоритмом и является полностью прозрачным и 100% справедливым.',
    'aero_rule22' => 'Общая теоретическая доходность игрока составляет 97%. Это означает, что в среднем, на каждые 100 раундов каждые 3 раунда заканчиваются тем, что самолет улетел в самом начале раунда.',
    'aero_rule23' => 'Переключите переключатель «звуки», чтобы включить или выключить звуки игры.',
    'aero_rule24' => 'Переключите «музыка», чтобы включить или выключить игровой музыку.',
    'aero_rule25' => 'Нажмите «Как играть», чтобы просмотреть подробные правила игры.',
    'aero_rule26' => 'Если подключение к Интернету будет прервано, когда ставка активна, игра вынесет деньги с текущим множителем, а сумма выигрыша будет добавлена ​​в ваш баланс.',
    'aero_rule27' => 'В случае неисправности игрового аппаратного обеспечения/программного обеспечения все затронутые ставки на игры и выплаты получают недействительными, и все затронутые ставки возвращаются.',
    'aero_rule28' => 'Более подробная информация',
    'aero_rule29' => 'Игровые функции - BET & CASH OUT',
    'aero_rule30' => 'Игровые функции - Autoplay и Auto наличные',
    'aero_rule31' => 'Игровые функции - живые ставки и статистика',
    'aero_rule32' => 'Игровые функции - рандомизация',
    'aero_rule33' => 'Игровые функции - вернуться к игроку',
    'aero_rule34' => 'Игровые функции - меню игры',
    'aero_rule35' => 'Игровые функции - другие',

    'all_moonbets_count' => 'Общее количество ставок',

    'moon_prev_round_btn' => 'Предыдущий раунд',
);
