<?php
//линии
$l['lines']=[
		1=>[
			[0,0,0,0,0],
			[1,1,1,1,1],
			[0,0,0,0,0],
		],

		2=>[
			[1,1,1,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],

		3=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,1,1,1],
		],

		4=>[
			[1,0,0,0,1],
			[0,1,0,1,0],
			[0,0,1,0,0],
		],

		5=>[
			[0,0,1,0,0],
			[0,1,0,1,0],
			[1,0,0,0,1],
		],//5

		6=>[
			[0,0,0,0,0],
			[1,0,0,0,1],
			[0,1,1,1,0],
		],

		7=>[ //7
			[0,1,1,1,0],
			[1,0,0,0,1],
			[0,0,0,0,0],
		],

		8=>[ //8
			[0,0,0,1,1],
			[0,0,1,0,0],
			[1,1,0,0,0],
		],


		9=>[ //9
			[1,1,0,0,0],
			[0,0,1,0,0],
			[0,0,0,1,1],
		],


];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='left';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[8];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[9,10];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//символ,который запускает бонусы (не фригеймы), используется например в крейзи монкей
$l['bonus']=[];
//запуск бонуса
//первое число - количество бонусов при выпадении 0 бонусных символов на барабане , второе - при выпадении 1 символа  и.т.д
$l['bonus_param']=[0,0,0,0,0,0];
//настройка для бонус игры
$l['bonus_chance']=[];
//дополнительная жизнь в бонус игре
$l['extralife']=[];


//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д

$l['pay'][0] =[0,0,0,10,30,100]; //0 вишня
$l['pay'][1] =[0,0,0,10,30,100]; //1 лимон
$l['pay'][2] =[0,0,0,10,30,100]; //2 апельсин
$l['pay'][3] =[0,0,0,10,30,100]; //3 слива
$l['pay'][4] =[0,0,0,20,50,200]; //4 колокол
$l['pay'][5] =[0,0,0,40,100,500]; //5 виноград
$l['pay'][6] =[0,0,0,40,100,500]; //6 арбуз
$l['pay'][7] =[0,0,10,50,200,3000]; //7 7
$l['pay'][8] = [0,0,0,0,0,0];//8 клевер wild
$l['pay'][9] = [0,0,0,20,0,0];// звезда
$l['pay'][10] = [0,0,0,3,20,100];// доллар


/*
    -1 normal: 0 => 35052072 ,
-1 wild  : 0 => 0 ,
0 normal: 1 => 0 ,2 => 0 ,3 => 66960 ,4 => 15120 ,5 => 1620 ,
0 wild  : 1 => 0 ,2 => 0 ,3 => 147312 ,4 => 57456 ,5 => 6156 ,
1 normal: 1 => 0 ,2 => 0 ,3 => 96720 ,4 => 13440 ,5 => 1440 ,
1 wild  : 1 => 0 ,2 => 0 ,3 => 174096 ,4 => 52416 ,5 => 5616 ,
2 normal: 1 => 0 ,2 => 0 ,3 => 96720 ,4 => 12960 ,5 => 1920 ,
2 wild  : 1 => 0 ,2 => 0 ,3 => 174096 ,4 => 50544 ,5 => 7488 ,
3 normal: 1 => 0 ,2 => 0 ,3 => 100440 ,4 => 9720 ,5 => 1440 ,
3 wild  : 1 => 0 ,2 => 0 ,3 => 180792 ,4 => 44712 ,5 => 6624 ,
4 normal: 1 => 0 ,2 => 0 ,3 => 26784 ,4 => 2592 ,5 => 384 ,
4 wild  : 1 => 0 ,2 => 0 ,3 => 90396 ,4 => 20088 ,5 => 2976 ,
5 normal: 1 => 0 ,2 => 0 ,3 => 8370 ,4 => 810 ,5 => 120 ,
5 wild  : 1 => 0 ,2 => 0 ,3 => 25110 ,4 => 5670 ,5 => 840 ,
6 normal: 1 => 0 ,2 => 0 ,3 => 4030 ,4 => 540 ,5 => 80 ,
6 wild  : 1 => 0 ,2 => 0 ,3 => 21762 ,4 => 5508 ,5 => 816 ,
7 normal: 1 => 0 ,2 => 59334 ,3 => 1736 ,4 => 112 ,5 => 12 ,
7 wild  : 1 => 0 ,2 => 89001 ,3 => 15624 ,4 => 2688 ,5 => 288 ,
8 normal: 1 => 0 ,2 => 0 ,3 => 0 ,4 => 0 ,5 => 0 ,
8 wild  : 1 => 0 ,2 => 0 ,3 => 0 ,4 => 0 ,5 => 0 ,
9 normal: 1 => 0 ,2 => 0 ,3 => 24300 ,4 => 0 ,5 => 0 ,
9 wild  : 1 => 0 ,2 => 0 ,3 => 0 ,4 => 0 ,5 => 0 ,
10 normal: 1 => 4860 ,2 => 243 ,3 => 236520 ,4 => 11988 ,5 => 243 ,
10 wild  : 1 => 0 ,2 => 0 ,3 => 0 ,4 => 0 ,5 => 0 ,

                        spin_count: 36763551
                        in: 36763551
                        out: 35367110
                        z: 0.96
                        bonus: 0 0 0 0 0 0
                        freespin: 0
            winScatter: 1561680
                        time: 5639
                        winSym: [0,0,0,0,0,0,0,0,0,0]
                        bars: [4,0,0,0,9,3,3,3,6,5,4,1,1,1,7,4,2,2,2,10,4,0,0,0,1,1,1,2,2,2,3,3,3]
[0,0,0,1,2,2,2,3,10,4,0,1,1,1,2,3,3,3,7,4,5,2,1,3,0,4,6,8,4,6,5,7,4]
[0,5,6,3,10,6,5,0,0,0,2,2,2,5,4,7,6,5,1,1,1,3,3,3,9,6,4,2,5,6,1,5,8]
[1,5,10,6,0,0,0,3,3,3,2,2,2,1,1,1,4,6,7,5,0,4,2,0,6,5,0,7,1,4,6,3,8]
[3,4,7,5,1,1,1,10,4,6,2,2,2,5,7,9,6,7,0,0,0,5,4,3,6,4,2,5,6,3,3]
  */
$l['bars']=[
		1=>[4,0,0,0,9,3,3,3,6,5,4,1,1,1,7,4,2,2,2,10,4,0,0,0,1,1,1,2,2,2,3,3,3],
		2=>[0,0,0,1,2,2,2,3,10,4,0,1,1,1,2,3,3,3,7,4,5,2,1,3,0,4,6,8,4,6,5,7,4],
		3=>[0,5,6,3,10,6,5,0,0,0,2,2,2,5,4,7,6,5,1,1,1,3,3,3,9,6,4,2,5,6,1,5,8],
		4=>[1,5,10,6,0,0,0,3,3,3,2,2,2,1,1,1,4,6,7,5,0,4,2,0,6,5,0,7,1,4,6,3,8],
		5=>[3,4,7,5,1,1,1,10,4,6,2,2,2,5,7,9,6,7,0,0,0,5,4,3,6,4,2,5,6,3,3]
];


//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets'] = [1,2,5,10,20,50,100,0.1,0.2,0.5];

$l['bonus_double'] = 'all'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша


return $l;