<?php

return [
    'levels' => [
        1 => 0,
        2 => 10,
        3 => 50,
        4 => 100,
        5 => 500,
        6 => 2000,
        7 => 5000,
        8 => 10000,
        9 => 20000,
        10 => 50000,
        11 => 100000
    ],
    'names' => [
        1 => 'Новичок',
        2 => 'Любитель',
        3 => 'Специалист',
        4 => 'Мастер',
        5 => 'Эксперт',
        6 => 'Профессионал',
        7 => 'Bronze',
        8 => 'Silver',
        9 => 'Gold',
        10 => 'VIP Platinum',
        11 => 'VIP Diamond',    
    ],
    'coeffs' => [
        1 => 0,
        2 => 0.01,
        3 => 0.02,
        4 => 0.05,
        5 => 0.1,
        6 => 0.2,
        7 => 0.3,
        8 => 0.4,
        9 => 0.5,
        10 => 0.6,
        11 => 0.7,
    ],
    "up_rates" => [
        "Monday" => 2,
    ],
];

