<?php defined('SYSPATH') or die('No direct script access.');

return [
    'lang'=>[
        'en'=>__('Английский'),
        'de'=>__('Немецкий'),
        'fr'=>__('Французский'),
        'tr'=>__('Турецкий'),
        'uk'=>__('Украинский'), // был ua
        'es'=>__('Испанский'),
        'zh'=>__('Китайский'), // был cn
        'hi'=>__('Индийский'), // был in
        'ko'=>__('Корейский'), // был kr
        'ru'=>__('Русский'),
        'tl'=>__('Филиппинский'), // был ph
        'vi'=>__('Вьетнамский'), // был vn
        'th'=>__('Тайский'),
        'pt'=>__('Португальский'),
        'lt'=>__('Литовский'),

        'bn'=>__('Бенгальский'), // был bd
        'el'=>__('Греческий'), // был gr
        'id'=>__('Индонезийский'),
        'it'=>__('Итальянский'),
        'kk'=>__('Казахский'), // был kz
        'ky'=>__('Киргизский'), // был kg

        'mr'=>__('Маратхи'),

        'pl'=>__('Польский'),

        'sw'=>__('Суахили'),

        'te'=>__('Телугу'),
        'tg'=>__('Таджикский'), // был tj
        'uz'=>__('Узбекский'),
		'az'=>__('Азербайджанский'),
    ],
];
