<?php

return [
        'default' => [
            'register' => [
                [
                    "title" => "Успешная регистрация!",
                    "text" => "Введите бонус код 777 чтобы получить 100% на ваш депозит.",
                ],
                [
                    "title" => "ДОРОГОЙ ИГРОК!",
                    "text" => "Специально для Вас в нашем клубе действуют уникальные <a href='/page/view/promos'>акции</a>. Получите свои первые бонусы уже сейчас",
                ],
                [   
                    "title" => "ХОТИТЕ ПОЛУЧАТЬ БОЛЬШЕ БОНУСОВ И СТАТИСТИКУ ИГР?",
                    "text" => "Подпишитесь на push-уведомления от команды клуба Вулкан (кликнув по колокольчику справа) и сделайте свою игру ещё выгоднее!
                                Мы будем писать вам только о самых важных событиях и радовать бонусами: деньгами, талисманами, фриспинами. Будет круто!",
                ],
            ],
        ],
        
];

