<?php

$l['lines']    = [
        1 => [
                [0,0,0,0,0,0],
                [1,1,1,1,1,1],
                [0,0,0,0,0,0],
        ],
        2 => [
                [1,1,1,1,1,1],
                [0,0,0,0,0,0],
                [0,0,0,0,0,0],
        ],
        3 => [
                [0,0,0,0,0,0],
                [0,0,0,0,0,0],
                [1,1,1,1,1,1],
        ],

        4 => [
                [1,1,0,0,0,0],
                [0,0,1,1,0,0],
                [0,0,0,0,1,1],
        ],
        5 => [
                [0,0,0,0,1,1],
                [0,0,1,1,0,0],
                [1,1,0,0,0,0],
        ],

        6 => [
                [0,0,1,1,0,0],
                [1,1,0,0,1,1],
                [0,0,0,0,0,0],
        ],
        7 => [
                [0,0,0,0,0,0],
                [1,1,0,0,1,1],
                [0,0,1,1,0,0],
        ],
        8 => [
                [1,0,0,0,0,1],
                [0,1,0,0,1,0],
                [0,0,1,1,0,0],
        ],
        9 => [
                [0,0,1,1,0,0],
                [0,1,0,0,1,0],
                [1,0,0,0,0,1],
        ],

        10 => [
                [1,1,0,0,1,1],
                [0,0,1,1,0,0],
                [0,0,0,0,0,0],
        ],
        11 => [
                [0,0,0,0,0,0],
                [0,0,1,1,0,0],
                [1,1,0,0,1,1],
        ],
        12 => [
                [1,0,0,0,0,1],
                [0,0,0,0,0,0],
                [0,1,1,1,1,0],
        ],
        13 => [
                [0,1,1,1,1,0],
                [0,0,0,0,0,0],
                [1,0,0,0,0,1],
        ],
        14 => [
                [1,0,0,0,0,1],
                [0,1,1,1,1,0],
                [0,0,0,0,0,0],
        ],
        15 => [
                [0,0,0,0,0,0],
                [0,1,1,1,1,0],
                [1,0,0,0,0,1],
        ],
        16 => [
                [0,0,0,0,0,0],
                [1,0,0,0,0,1],
                [0,1,1,1,1,0],
        ],
        17 => [
                [0,1,1,1,1,0],
                [1,0,0,0,0,1],
                [0,0,0,0,0,0],
        ],
        18 => [
                [1,0,1,1,0,1],
                [0,1,0,0,1,0],
                [0,0,0,0,0,0],
        ],
        19 => [
                [0,0,0,0,0,0],
                [0,1,0,0,1,0],
                [1,0,1,1,0,1],
        ],
        20 => [
                [1,0,1,1,0,1],
                [0,0,0,0,0,0],
                [0,1,0,0,1,0],
        ],
];
//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule'] = 'left6';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']              = [];
//дикий, который заменяет другие символы в комбинациях
$l['wild']                 = [8];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']      = 1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']          = [9];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']               = [9];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']           = [0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']      = 1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']            = 'sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode'] = 'simple';

//символ,который запускает бонусы (не фригеймы), используется например в крейзи монкей
$l['bonus']        = [];
//запуск бонуса
//первое число - количество бонусов при выпадении 0 бонусных символов на барабане , второе - при выпадении 1 символа  и.т.д
$l['bonus_param']  = [0,0,0,0,0,0];
//настройка для бонус игры
$l['bonus_chance'] = [];
//дополнительная жизнь в бонус игре
$l['extralife']    = [];

//new no error in paytable
//9666734400 9300134730 0.96207616

$l['bars'] = [

        1 => [0,9,       2,4,0,0,0,3,3,3,4,0,0,0,5,1,1,1,6,9,2,2,2,7,3,3,3,4,0,0,0,3,3,3,6,5,4,1,1,1,7,4,2,2,2,4,0,0],
        2 => [ 3,3,7,4,8,1,1,1,4,5,2,2,2,      7,4,5,0,0,0,5,6,4,0,0,0,6,7,2,2,2,4,5,6,3,3,3,9,6,1,1,1,   8,    7,4,6,3],
        3 => [  2,2,2,6,9,4,3,3,3,7,5,1,1,1,8,6,4,5,7,0,0,0,      2,2,2,5,4,7,6,5,8,1,1,1,      3,3,3,6,5,0,0,0,6,7,5],
        4 => [4  ,3,   3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,      7,4,6,8,3,3,3,9,1,1,1,8,4,6,0,0,0,],
        5 => [7  ,1   ,1,1,1,    8,      4,5,7,0,0,0,6,3,3,3,5,6,4,2,2,2,6,1,1,1,4,7,5,8,3,3,3,6,      4,2,2,2,7,4,5,6,9,5,0,0,0],
        6 => [0,0,0,5,4,3,5,6,4,2,2,2,5,6,9,3,3,3,4,7,0,0,0,5,1,1,1,7,4,6,2,2,2,5,4,9,6,3,3,7,1,1,1,6,7]
];





$l['pay'][0]  = [0,0,0,4,10,40,100]; //0 вишня
$l['pay'][1]  = [0,0,0,4,10,40,100]; //1 лимон
$l['pay'][2]  = [0,0,0,6,12,50,130]; //2 апельсин
$l['pay'][3]  = [0,0,0,6,12,50,130]; //3 слива
$l['pay'][4]  = [0,0,0,10,25,130,360]; //4 колокол
$l['pay'][5]  = [0,0,0,12,50,250,700]; //5 виноград
$l['pay'][6]  = [0,0,0,12,50,250,800]; //6 арбуз
$l['pay'][7]  = [0,0,0,24,100,500,3000]; //7 7
$l['pay'][8]  = [0,0,0,0,0,0,0];//8 клевер wild
$l['pay'][9] = [0,0,0,2,20,100,500];// доллар
//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets']   = [1, 2, 3, 4, 5];

$l['bonus_double'] = 'spin'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша
//требуется для корректного отображения кнопок + возможно есть функциональная завязка на клиенте
$l['heigth']      = 3;
$l['replace_bar'] = [8]; //symbols for replace bar if in

$l['lines_choose']= [20, 15, 10, 5, 1];



$l["barsCert"] = [
1 => [0,9,2,4,0,0,0,3,3,3,4,0,0,0,5,1,1,1,6,9,2,2,2,7,3,3,3,4,0,0,0,3,3,3,6,5,4,1,1,1,7,4,2,2,2,4,0,0],
2 => [3,3,7,4,8,1,1,1,4,5,2,2,2,7,4,5,0,0,0,5,6,4,0,0,0,6,7,2,2,2,4,5,6,3,3,3,9,6,1,1,1,8,7,4,6,3],
3 => [2,2,2,6,9,4,3,3,3,7,5,1,1,1,8,6,4,5,7,0,0,0,2,2,2,5,4,7,6,5,8,1,1,1,3,3,3,6,5,0,0,0,6,7,5],
4 => [4,3,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,7,4,6,8,3,3,3,9,1,1,1,8,4,6,0,0,0,4,3,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,7,4,6,8,3,3,3,9,1,1,1,8,4,6,0,0],
5 => [7,1,1,1,1,8,4,5,7,0,0,0,6,3,3,3,5,6,4,2,2,2,6,1,1,1,4,7,5,8,3,3,3,6,4,2,2,2,7,4,5,6,9,5,0,0,0],
6 => [0,0,0,5,4,3,5,6,4,2,2,2,5,6,9,3,3,3,4,7,0,0,0,5,1,1,1,7,4,6,2,2,2,5,4,9,6,3,3,7,1,1,1,6,7],
]; 

return $l;



