<?php
$l['lines'] = [
    1 => [
        [0,0,0,0,0,],
        [1,1,1,1,1,],
        [0,0,0,0,0,],
        [0,0,0,0,0,],
        [0,0,0,0,0,],
        [0,0,0,0,0,],
        [0,0,0,0,0,],
    ],
];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='payways6';


$l['heigth'] = 7;
//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[6];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[7];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

$l['canBuyBonus'] = false;
$l['freespinBuyMultiplier'] = 100;


$l['pay'][0] = [0,0,0,0,0.1,0.2,0.4];
$l['pay'][1] = [0,0,0,0,0.1,0.2,0.4];
$l['pay'][2] = [0,0,0,0,0.1,0.2,0.4];
$l['pay'][3] = [0,0,0,0,0.2,0.4,0.8];
$l['pay'][4] = [0,0,0,0,0.2,0.8,1];
$l['pay'][5] = [0,0,0,0.2,0.8,1,2];
$l['pay'][6] = [0,0,0,0.5,1,2,5];
$l['pay'][7] = [0,0,0,0,4,5,25];


//count:10000000 in:10000000 out:9715125.3999994 RTP:97.151254 freeStart:0
//count:100000000 in:100000000 out:97151253.999994 RTP:97.151254 freeStart:0
//count:100000000 in:100000000 out:97360112.900012 RTP:97.360113
$l['bars']=[
    1=>[1,1,1,1,1,5,5,5,2,2,2,2,2,1,1,1,1,1,2,2,2,2,2,4,2,2,2,5,5,5,1,1,1,5,5,5,3,3,3,2,2,2,2,2,0,0,0,2,2,2,5,1,1,1,7,4,4,4,1,1,1,1,1,5,5,5,2,2,2,2,2,1,1,1,1,1,2,2,2,2,2,
        1,1,1,1,1,2,2,2,5,5,5,7,1,1,1,5,5,5,0,0,0,5,5,5,2,3,3,3,4,4,4,2,2,2,1,1,1,1,1,2,2,2,2,2,3,3,3,2,2,2,1,1,1,2,2,2,1,1,1,0,0,0,3,3,3,4,4, 1,1,1,2,2,2,5,5,5,1,1,2,2,

        ],
    2=>[4,4,4,4,4,3,3,3,3,3,3,1,1,1,4,4,4,4,4,3,3,3,3,3,3,7,0,0,0,4,4,4,4,4,3,3,3,3,3,3,4,4,4,4,4,3,3,3,3,3,3,5,5,5,4,4,4,2,2,2,1,1,1,3,3,3,0,0,0,4,4,4,3,3,3,1,1,1,4,4,4,1,1,1,2,2,2,4,4,4,6,6,6,4,4,4,4,4,3,3,3,3,3,3,
        2,2,2,4,4,4,4,4,3,3,3,3,3,3,1,1,1,4,4,4,4,4,3,3,3,3,3,3,0,0,0,5,5,5,4,4,4,4,4,3,3,3,3,3,3,1,1,1,7,3,3,3,2,2,2,4,4,4,4,4,3,3,3,3,3,3,0,0,0,5,5,5,

        ],
    3=>[2,2,5,5,5,0,0,0,0,0,0,1,1,1,0,0,0,0,0,7,5,5,5,3,3,3,0,0,0,2,2,2,0,0,0,1,1,1,5,5,5,2,2,2,0,0,0,7,3,3,3,0,0,0,4,4,4,2,2,2,0,0,0,0,0,3,3,3,0,0,0,
        4,4,4,0,0,0,0,0,1,1,1,0,0,0,3,3,3,0,0,0,0,0,6,6,6,4,0,0,0,0,0,0,4,4,0,0,0,1,1,1,0,0,0,0,0,3,3,3,0,0,0,2,0,0,
        2,2,5,5,5,0,0,0,0,0,0,1,1,1,0,0,0,0,0,7,5,5,5,3,3,3,0,0,0,2,2,2,0,0,0,1,1,1,5,5,5,2,2,2,0,0,0,7,3,3,3,0,0,0,4,4,4,2,2,2,0,0,0,0,0,3,3,3,0,0,0,
        4,4,4,0,0,0,0,0,1,1,1,0,0,0,3,3,3,0,0,0,0,0,6,6,6,4,0,0,0,0,0,0,4,4,0,0,0,1,1,1,0,0,0,0,0,3,3,3,0,0,0,2,0,0,
        2,2,5,5,5,0,0,0,0,0,0,1,1,1,0,0,0,0,0,7,5,5,5,3,3,3,0,0,0,2,2,2,0,0,0,1,1,1,5,5,5,2,2,2,0,0,0,7,3,3,3,0,0,0,4,4,4,2,2,2,0,0,0,0,0,3,3,3,0,0,0,
        4,4,4,0,0,0,0,0,1,1,1,0,0,0,3,3,3,0,0,0,0,0,6,6,6,4,0,0,0,0,0,0,4,4,0,0,0,1,1,1,0,0,0,0,0,3,3,3,0,0,0,2,0,

        ],
    4=>[0,4,4,4,2,2,2,5,5,5,1,1,1,2,0,0,0,4,4,4,3,3,3,1,1,1,6,6,6,2,2,2,4,4,4,0,0,0,5,5,5,4,4,4,1,1,1,2,2,2,7,0,0,0,1,1,1,3,3,3,0,0,0,5,5,5,3,3,3,1,1,1,7,2,2,2,0,0],
    5=>[1,2,2,2,0,0,0,3,3,3,1,1,1,0,0,0,3,3,3,2,2,2,5,5,5,0,0,0,7,1,1,1,3,3,3,2,2,2,6,6,6,1,1,1,4,4,4,2,2,2,5,5,5,1,1,1,3,7,0,0,0,4,4,4,1,1,1,5,5,5,2,2,2,4,4,4,1,1,1,2,2,2],
    6=>[2,2,5,5,5,1,1,1,7,5,5,5,3,3,3,2,2,2,0,0,0,1,1,1,5,5,5,2,2,2,7,3,3,3,0,0,0,4,4,4,2,2,2,3,3,3,0,0,0,4,4,4,1,1,1,0,0,0,3,3,3,4,4,4,0,0,0,1,1,1,3,3,3,0,0,0,2],
];

$l['lines_choose']= [1];
$l['bets'] = [1,2,5,10,20];



return $l;
