<?php
//линии
$l['lines']=[
		1=>[
			[0,0,0],
			[1,1,1],
			[0,0,0],
		],

		2=>[
			[1,1,1],
			[0,0,0],
			[0,0,0],
		],

		3=>[
			[0,0,0],
			[0,0,0],
			[1,1,1],
		],

		4=>[
			[1,0,0],
			[0,1,0],
			[0,0,1],
		],

		5=>[
			[0,0,1],
			[0,1,0],
			[1,0,0],
		],//5

        6=>[
            [1,0,1],
            [0,1,0],
            [0,0,0],
        ],//6

        7=>[
            [0,0,0],
            [1,0,1],
            [0,1,0],
        ],//7

        8=>[
            [0,1,0],
            [1,0,1],
            [0,0,0],
        ],//8

        9=>[
            [0,0,0],
            [0,1,0],
            [1,0,1],
        ],//9

        10=>[
            [0,0,1],
            [1,1,0],
            [0,0,0],
        ],//9

];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='3';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';


//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д
$l['pay'][0] = array( 0, 0, 0, 5 );   // свечи
$l['pay'][1] = array( 0, 0, 0, 10 );   // паук
$l['pay'][2] = array( 0, 0, 0, 20 );   // скелет
$l['pay'][3] = array( 0, 0, 0, 30 );   // пугало
$l['pay'][4] = array( 0, 0, 0, 100 );  // приведение
$l['pay'][5] = array( 0, 0, 0, 200 );  // замок
$l['pay'][6] = array( 0, 0, 0, 500 );  // ведьма
$l['pay'][7] = array( 0, 0, 0, 1000 ); //  тыква

//0.9604818258664413
$l['bars96']=[  
    1=>[6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,
                    6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,3,5,5,7,2,2,2,2,2,1,1,1],
    2=>[6,0,3,0,3,3,3,5,2,5,2,2,2,2,1,7,1,1,1,0,4,0,4,4,4,7],
    3=>[6,1,1,1,1,0,0,7,4,4,4,4,0,0,3,3,3,3,5,5,2,2,2,2,1,7],
];

//0.965034965034965
$l['bars965']=[  
    1=>[6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,
                    6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,2,1,1,1],
    2=>[6,0,3,0,3,3,3,5,2,5,2,2,2,2,1,7,1,1,1,0,4,0,4,4,4,7],
    3=>[6,1,1,1,1,0,0,7,4,4,4,4,0,0,3,3,3,3,5,5,2,2,2,2,1,7],
];


//0.9719482796405874
$l['bars97']=[   
    1=>[6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1],
    2=>[6,0,3,0,3,3,3,5,2,5,2,2,2,2,1,7,1,1,1,0,4,0,4,4,4,7],
    3=>[6,1,1,1,1,0,0,7,4,4,4,4,0,0,3,3,3,3,5,5,2,2,2,2,1,7],
];


//0.9757934373318988
$l['bars975']=[   
    1=>[6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,
                    6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,5,7,2,2,2,2,1,1,1],
    2=>[6,0,3,0,3,3,3,5,2,5,2,2,2,2,1,7,1,1,1,0,4,0,4,4,4,7],
    3=>[6,1,1,1,1,0,0,7,4,4,4,4,0,0,3,3,3,3,5,5,2,2,2,2,1,7],
];


//0.981614539306847
$l['bars98']=[
    1=>[6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,
                    6,1,1,1,1,0,0,4,4,4,4,4,0,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1],
    2=>[6,0,3,0,3,3,3,5,2,5,2,2,2,2,1,7,1,1,1,0,4,0,4,4,4,7],
    3=>[6,1,1,1,1,0,0,7,4,4,4,4,0,0,3,3,3,3,5,5,2,2,2,2,1,7],
];





$l['bars96']=$l['bars965']=$l['bars97'];
//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets'] = [1,2,5,10,20,50,100,0.1,0.2,0.5];

$l['bonus_double'] = 'none'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша. любое другое - не важно
$l['lines_choose']= [10,7,5,3,1];
$l['staticlines']=[10];



$l["barsCert"] = [
1 => [6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,1,1,1,6,1,1,1,1,0,0,4,4,4,4,0,0,3,3,3,3,5,5,7,2,2,2,2,2,1,1,1],
2 => [6,0,3,0,3,3,3,5,2,5,2,2,2,2,1,7,1,1,1,0,4,0,4,4,4,7],
3 => [6,1,1,1,1,0,0,7,4,4,4,4,0,0,3,3,3,3,5,5,2,2,2,2,1,7],
]; 

return $l;



