<?php
//линии
$l['lines']=[
		1=>[
			[0,0,0,],
			[1,1,1,],
			[0,0,0,],
		],

		2=>[
			[1,1,1,],
			[0,0,0,],
			[0,0,0,],
		],

		3=>[
			[0,0,0,],
			[0,0,0,],
			[1,1,1,],
		],

		4=>[
			[1,0,0,],
			[0,1,0,],
			[0,0,1,],
		],

		5=>[
			[0,0,1,],
			[0,1,0,],
			[1,0,0,],
		],//5
];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='3';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[6];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[7];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[6];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,20];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д
$l['pay'][0] = array( 0, 0, 0, 5 );   //  вишня
$l['pay'][1] = array( 0, 0, 0, 10 );   //  лимон
$l['pay'][2] = array( 0, 0, 0, 20 );   //  слива
$l['pay'][3] = array( 0, 0, 0, 100 );   //  арбуз
$l['pay'][4] = array( 0, 0, 0, 250 );  //  колокол
$l['pay'][5] = array( 0, 0, 0, 500,);  // 7 - в FG нет
$l['pay'][6] = array( 0, 0, 0, 10 );  //  скаттер выплата 10, потому что 50 - за все выплачивается, а по линии 1
$l['pay'][7] = array( 0, 0, 0, 500,);  // 7 - только в FG

//FG

//!!! заменен в FG барабане символ 5 на 7

$l['bn']=[
    1=>[7,7,7,7,6,0,0,0,0,0,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,3,3,3,3,4,4,4,0,0,0,0,0,0,6],
    2=>[7,7,7,7,6,0,0,0,0,0,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,3,3,3,3,4,4,4,0,0,0,0,0,0,6],
    3=>[7,7,7,7,6,0,0,0,0,0,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,3,3,3,3,4,4,4,0,0,0,0,0,0,6],
];

$l['96']=[
    1=>[5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
    2=>[5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
    3=>[5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
];

$l['94']=[
    1=>[5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,1,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
    2=>[5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,1,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
    3=>[5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,1,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
];

$l['bars_90']=$l['94'];
$l['bars_92']=$l['94'];
$l['bars_94']=$l['94'];
$l['bars_96']=$l['96'];
$l['barFree']=$l['bn'];


$l['bars']=$l['bars_96'];


/*!!!!!!!!!!FG!!!!!!!!!!!!!*/

//spin_count: 91125
//in: 91125
//out: 234820
//z: 2.58
//bonus: 0 0 0 0
//freespin: 14580
//winScatter: 7290


/*!!!!!!!!!!96!!!!!!!!!!!!!*/
//Итого z	0,9610773596

//spin_count: 681472
//in: 681472
//out: 447875
//z: 0.66
//bonus: 0 0 0 0
//freespin: 67500
//winScatter: 33750


/*!!!!!!!!!!94!!!!!!!!!!!!!*/
//Итого z	0,9507174329

//spin_count: 681472
//in: 681472
//out: 440815
//z: 0.65
//bonus: 0 0 0 0
//freespin: 67500
//winScatter: 33750


//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100,50,20,10,200];
$l['bets']   = [5, 10, 25, 50, 100];

$l['bonus_double']='spin';

$l['lines_choose']= [5,4,3,2,1];
$l['staticlines']=[5];



$l["barsCert"] = [
1 => [5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
2 => [5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
3 => [5,5,5,6,0,0,0,2,2,2,2,2,1,1,1,1,1,1,1,1,1,6,0,0,0,0,0,3,3,3,3,3,3,3,3,3,4,4,4,4,4,0,0,0,0,0,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,1,1,1,1,1,1,6,0,0,0,0,0,6],
]; 



 $l["barsFreeCert"] = [
1 => [7,7,7,7,6,0,0,0,0,0,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,3,3,3,3,4,4,4,0,0,0,0,0,0,6],
2 => [7,7,7,7,6,0,0,0,0,0,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,3,3,3,3,4,4,4,0,0,0,0,0,0,6],
3 => [7,7,7,7,6,0,0,0,0,0,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,6,0,0,0,3,3,3,3,4,4,4,0,0,0,0,0,0,6],
];


return $l;



