<?php


$l['lines']=array(
		1=>[
			[0,0,0,0,0],
			[1,1,1,1,1],
			[0,0,0,0,0],
		],

		2=>[
			[1,1,1,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],

		3=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,1,1,1],
		],

		4=>[
			[1,0,0,0,1],
			[0,1,0,1,0],
			[0,0,1,0,0],
		],

		5=>[
			[0,0,1,0,0],
			[0,1,0,1,0],
			[1,0,0,0,1],
		],//5

		6=>[
			[1,1,0,0,0],
			[0,0,1,0,0],
			[0,0,0,1,1],
		],

		7=>[ //7
			[0,0,0,1,1],
			[0,0,1,0,0],
			[1,1,0,0,0],
		],

		8=>[ //8
			[0,0,0,0,0],
			[1,0,0,0,1],
			[0,1,1,1,0],
		],


		9=>[ //9
			[0,1,1,1,0],
			[1,0,0,0,1],
			[0,0,0,0,0],
		],

        10=>[ //10
			[1,0,0,0,1],
			[0,1,1,1,0],
			[0,0,0,0,0],
		],
        11=>[
			[0,0,0,0,0],
			[0,1,1,1,0],
			[1,0,0,0,1],
		],
		12=>[
			[0,0,0,1,0],
			[1,0,1,0,1],
			[0,1,0,0,0],
		],
		13=>[
			[0,1,0,0,0],
			[1,0,1,0,1],
			[0,0,0,1,0],
		],
		14=>[
			[1,0,1,0,1],
			[0,1,0,1,0],
			[0,0,0,0,0],
		],
		15=>[
			[0,0,0,0,0],
			[0,1,0,1,0],
			[1,0,1,0,1],
		],//5
		16=>[
			[0,0,0,0,0],
			[1,1,0,1,1],
			[0,0,1,0,0],
		],
		17=>[ //7
			[0,0,1,0,0],
			[1,1,0,1,1],
			[0,0,0,0,0],
		],
		18=>[ //8
			[1,0,1,0,1],
			[0,0,0,0,0],
			[0,1,0,1,0],
		],
		19=>[ //9
			[0,1,0,1,0],
			[0,0,0,0,0],
			[1,0,1,0,1],
		],
        20=>[ //10
			[0,1,0,1,0],
			[1,0,0,0,1],
			[0,0,1,0,0],
		],
);



//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='left';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[12];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[11];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=2;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[12];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,50,50,50];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//символ,который запускает бонусы (не фригеймы), используется например в крейзи монкей
$l['bonus']=[];
//запуск бонуса
//первое число - количество бонусов при выпадении 0 бонусных символов на барабане , второе - при выпадении 1 символа  и.т.д
$l['bonus_param']=[0,0,0,0,0,0];
//настройка для бонус игры
$l['bonus_chance']=[];
//дополнительная жизнь в бонус игре
$l['extralife']=[];


//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д
$l['pay'][0] = array( 0, 0, 2, 4, 30, 100 );   //   9
$l['pay'][1] = array( 0, 0, 0, 4, 30, 100 );   //   10
$l['pay'][2] = array( 0, 0, 0, 4, 30, 100 );   //   J
$l['pay'][3] = array( 0, 0, 0, 4, 30, 100);    //   Q
$l['pay'][4] = array( 0, 0, 0, 10, 50, 120 );  //   K
$l['pay'][5] = array( 0, 0, 0, 10, 50, 120 );  //  A
$l['pay'][6] = array( 0, 0, 0, 20, 70, 250 );  //  blue
$l['pay'][7] = array( 0, 0, 0, 20, 70, 250 );  //  pink
$l['pay'][8] = array( 0, 0, 0, 20, 100, 400 ); //  red
$l['pay'][9] = array( 0, 0, 2, 30, 120, 800 ); //   green
$l['pay'][10] = array( 0, 0, 2, 30, 120, 800 );//  yellow
$l['pay'][11] = array( 0, 0, 10, 250, 2500, 9000 );//  tanos wild
$l['pay'][12] = array( 0, 0, 2, 4, 20, 500 );//  gems scatter




$l['bars']=[
    1=>[6,1,11,3,0,4,1,5,9,1,6,4,1,8,5,3,12,2,3,10,5,7,1,3,6,1,3,2,8,5],
    2=>[7,4,11,5,4,1,9,3,5,0,6,2,4,10,2,3,9,4,2,7,4,1,12,0,8,2,7,4,6,10,1,0,8,4,2,7,5,2,7,0,8,3,5],
    3=>[1,3,11,1,8,2,3,9,4,6,2,8,1,0,9,5,4,3,0,12,3,1,7,1,10,2,3,8,5,7,3,1,9,5,7,0,5,10,1,2,7,5,10],
    4=>[4,1,11,3,10,5,2,8,3,9,5,6,2,7,0,1,6,0,4,7,1,12,4,6,2,9,3,6,0,7,4,5,6,2,10,6,0,8,2,7,0,2,10],
    5=>[4,5,11,4,8,3,7,0,2,6,1,10,5,4,9,3,7,2,1,9,0,12,7,2,8,0,6,5,9,2,4,9,0,2,10,4,2,8,0,7,4,0,9],
];




//0,9612458841
// если убрать 1 строчку из 5 барабана 95,3
$l['barFree']=[
    1=>[6,1,11,3,0,7,1,4,9,5,6,2,0,8,5,3,12,2,3,10,5,7,2,3,9,4,1,2,10,1,6,4,8,1,3],
    2=>[7,4,11,5,4,2,9,3,8,1,7,4,11,5,4,1,2,0,8,2,5,10,1,6,2,8,6,1,12,0,7,3,6,1,3],
    3=>[1,3,11,1,8,5,4,9,6,1,3,11,1,8,5,0,2,3,4,9,0,2,7,0,10,6,5,0,12,3,2,7,10,5,7,2],
    4=>[4,1,11,3,10,5,2,8,5,9,4,6,2,8,7,1,2,4,6,0,1,7,5,3,2,9,7,1,12,4,6,3,10,0,5,8],
    5=>[4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1
        ,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1
        ,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1
        ,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1
        ,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,11, 7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1
        ],
];


$l['bonus_double']='spin';

$l['lines_choose']= [20, 15, 10, 5, 1];
$l['bets']=[1,2,3,4,5];




$l["barsCert"] = [
1 => [6,1,11,3,0,4,1,5,9,1,6,4,1,8,5,3,12,2,3,10,5,7,1,3,6,1,3,2,8,5],
2 => [7,4,11,5,4,1,9,3,5,0,6,2,4,10,2,3,9,4,2,7,4,1,12,0,8,2,7,4,6,10,1,0,8,4,2,7,5,2,7,0,8,3,5],
3 => [1,3,11,1,8,2,3,9,4,6,2,8,1,0,9,5,4,3,0,12,3,1,7,1,10,2,3,8,5,7,3,1,9,5,7,0,5,10,1,2,7,5,10],
4 => [4,1,11,3,10,5,2,8,3,9,5,6,2,7,0,1,6,0,4,7,1,12,4,6,2,9,3,6,0,7,4,5,6,2,10,6,0,8,2,7,0,2,10],
5 => [4,5,11,4,8,3,7,0,2,6,1,10,5,4,9,3,7,2,1,9,0,12,7,2,8,0,6,5,9,2,4,9,0,2,10,4,2,8,0,7,4,0,9],
]; 



 $l["barsFreeCert"] = [
1 => [6,1,11,3,0,7,1,4,9,5,6,2,0,8,5,3,12,2,3,10,5,7,2,3,9,4,1,2,10,1,6,4,8,1,3],
2 => [7,4,11,5,4,2,9,3,8,1,7,4,11,5,4,1,2,0,8,2,5,10,1,6,2,8,6,1,12,0,7,3,6,1,3],
3 => [1,3,11,1,8,5,4,9,6,1,3,11,1,8,5,0,2,3,4,9,0,2,7,0,10,6,5,0,12,3,2,7,10,5,7,2],
4 => [4,1,11,3,10,5,2,8,5,9,4,6,2,8,7,1,2,4,6,0,1,7,5,3,2,9,7,1,12,4,6,3,10,0,5,8],
5 => [4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,12,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1,4,5,11,4,8,3,0,12,7,2,1,10,5,4,9,0,11,7,2,6,5,3,6,5,8,3,9,0,12,7,2,8,1,6,10,1],
];


return $l;



