<?php
//линии
$l['lines']=[
		1=>[
			[0,0,0,0,0,0],
			[1,1,1,1,1,1],
			[0,0,0,0,0,0],
		],

		2=>[
			[1,1,1,1,1,1],
			[0,0,0,0,0,0],
			[0,0,0,0,0,0],
		],

		3=>[
			[0,0,0,0,0,0],
			[0,0,0,0,0,0],
			[1,1,1,1,1,1],
		],

		4=>[
			[1,0,0,0,0,1],
			[0,1,0,0,1,0],
			[0,0,1,1,0,0],
		],

		5=>[
			[0,0,1,1,0,0],
			[0,1,0,0,1,0],
			[1,0,0,0,0,1],
		],//5
];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='left6';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[8];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[9,10];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[9,10];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//символ,который запускает бонусы (не фригеймы), используется например в крейзи монкей
$l['bonus']=[];
//запуск бонуса
//первое число - количество бонусов при выпадении 0 бонусных символов на барабане , второе - при выпадении 1 символа  и.т.д
$l['bonus_param']=[0,0,0,0,0,0];
//настройка для бонус игры
$l['bonus_chance']=[];
//дополнительная жизнь в бонус игре
$l['extralife']=[];
$l['replace_bar']=[8];

//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д

/*
122490055800 117785776538 0.9615946
*/

$l['bars']=[/*
		1=>[2,4,0,0,0,3,3,3,4,0,0,0,5,1,1,1,6,10,2,2,2,7,3,3,3,4,0,0,0,3,3,3,6,5,4,1,1,1,7,4,2,2,2,4,0,0],
		2=>[3,3,7,4,1,1,1,4,5,2,2,2,9,7,4,5,0,0,0,5,6,4,0,0,0,6,7,2,2,2,4,5,6,3,3,3,10,6,1,1,1,7,4,6,3],
		3=>[2,2,2,6,10,4,3,3,3,7,5,1,1,1,6,4,5,7,0,0,0,9,2,2,2,5,4,7,6,5,1,1,1,9,3,3,3,6,5,0,0,0,6,7,5],
		4=>[4,9,3,3,3,7,2,2,2,4,6,1,1,1,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,3,3,3,10,1,1,1,4,6,0,0,0],
                5=>[7,1,1,1,4,5,7,0,0,0,6,3,3,3,5,6,4,2,2,2,6,1,1,1,4,7,5,3,3,3,6,9,4,2,2,2,7,4,5,6,10,5,0,0,0],
		6=>[0,0,0,5,4,3,5,6,4,2,2,2,5,6,10,3,3,3,4,7,0,0,0,5,1,1,1,7,4,6,2,2,2,5,4,10,6,3,3,7,1,1,1,6,7]*/
                    
    		1=>[2,4,0,0,0,3,3,3,4,0,0,0,5,1,1,1,6,10,2,2,2,7,3,3,3,4,0,0,0,3,3,3,6,5,4,1,1,1,7,4,2,2,2,4,0,0],
		2=>[3,3,7,4,8,1,1,1,4,5,2,2,2,9,7,4,5,0,0,0,5,6,4,0,0,0,6,7,2,2,2,4,5,6,3,3,3,10,6,1,1,1,7,4,6,3],
		3=>[2,2,2,6,10,4,3,3,3,7,5,1,1,1,8,6,4,5,7,0,0,0,9,2,2,2,5,4,7,6,5,8,1,1,1,9,3,3,3,6,5,0,0,0,6,7,5
                    
                    ],
		4=>[4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1  ,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1  ,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1  ,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,
                    
                    4,9,3,3,3,7,2,2,2,4,6,1,1,1,8,5,6,7,5,2,2,2,5,7,0,0,0,4,5,9,7,4,6,8,3,3,3,10,1,1,1,4,6,0,0,0,


                    ],
                5=>[7,1,1,1,4,5,7,0,0,0,6,3,3,3,5,6,4,2,2,2,6,1,1,1,4,7,5,3,3,3,6,9,4,8,2,2,2,7,4,5,6,10,5,0,0,0],
		6=>[0,0,0,5,4,3,5,6,4,2,2,2,5,6,10,3,3,3,4,7,0,0,0,5,1,1,1,7,4,6,2,2,2,5,4,10,6,3,3,7,1,1,1,6,7]
    
    

    ];





$l['anypay']=[10];


$l['pay'][0] =[0,0,0,5,12.5,50,125]; //0 вишня
$l['pay'][1] =[0,0,0,5,12.5,50,125]; //1 лимон
$l['pay'][2] =[0,0,0,5,12.5,50,125]; //2 апельсин
$l['pay'][3] =[0,0,0,5,12.5,50,125]; //3 слива
$l['pay'][4] =[0,0,0,10,250,125,375]; //4 колокол
$l['pay'][5] =[0,0,0,12.5,500,250,750]; //5 виноград
$l['pay'][6] =[0,0,0,12.5,500,250,750]; //6 арбуз
$l['pay'][7] =[0,0,0,25,100,500,3000]; //7 7
$l['pay'][8] = [0,0,0,0,0,0,0];//8 клевер wild
$l['pay'][9] = [0,0,0,2,40,0,0];// звезда
$l['pay'][10] = [0,0,0,0.4,4,50,100];// доллар


//$l['bars']=[
//		1=>[4,4,4,4,4,4],
//		2=>[4,4,4,4,4,4],
//		3=>[4,4,4,4,4,4,4],
//		4=>[0,0,0,3,3,3,6,1,2,4,5,6,3,7,2,2,2,4,4,4,6,2,1,1,1,5,6,0,5,8,0,5,10],
//		5=>[5,2,3,0,6,5,4,4,4,1,7,4,5,3,2,9,6,2,2,2,0,0,0,6,1,1,1,7,3,3,3,10]
//];


//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets']   = [1, 2, 3, 4, 5];

$l['bonus_double'] = 'spin'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша

//требуется для корректного отображения кнопок + возможно есть функциональная завязка на клиенте
$l['staticlines'] = [5];

//EGT FORMAT



$l['egt']    = [
    "bets" => $l['bets'],
    "jackpotMinBet" => 1,
    "jackpot" => true,
    "mainFakeReels" => [
            [6, 2, 2, 2, 0, 0, 0, 5, 4, 1, 5, 10, 1, 1, 3, 4, 7, 4, 9, 4],
            [7, 2, 2, 2, 5, 3, 0, 0, 10, 6, 3, 3, 1, 1, 4, 1, 4, 8, 4, 2],
            [6, 1, 1, 8, 7, 1, 5, 3, 3, 9, 1, 4, 0, 4, 2, 2, 2, 10, 0, 0],
            [1, 1, 1, 7, 1, 3, 3, 8, 6, 4, 3, 4, 2, 2, 10, 2, 0, 0, 5, 1],
            [7, 3, 3, 2, 2, 1, 6, 10, 1, 1, 3, 3, 3, 2, 7, 0, 0, 4, 9, 4],
    ],
    "jackpotMaxBet" => 100000,
    "denominations" => [[100,70,3000000]]
];

foreach($l['pay'] as $p) {
    $l['egt']['paytableCoef'][]=[
        "coef" => array_values(array_filter($p,function($v)
        {
            if($v > 0)
                return $v;
        })),
        "multiplier" => 1
    ];
}


return $l;