<?php
//линии
$l['lines']=[
		1=>[
			[0,0,0,0,0],
			[1,1,1,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],

		2=>[
			[1,1,1,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],

		3=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,1,1,1],
			[0,0,0,0,0],
		],

		4=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,1,1,1],
		],

		5=>[
			[0,0,0,0,0],
			[1,0,0,0,1],
			[0,1,0,1,0],
			[0,0,1,0,0],
		],//5

		6=>[
			[0,0,1,0,0],
			[0,1,0,1,0],
			[1,0,0,0,1],
			[0,0,0,0,0],
		],

		7=>[ //7
			[1,1,1,0,0],
			[0,0,0,1,0],
			[0,0,0,0,1],
			[0,0,0,0,0],
		],

		8=>[ //8
			[0,0,0,0,1],
			[0,0,0,1,0],
			[0,0,1,0,0],
			[1,1,0,0,0],
		],


		9=>[ //9
			[0,0,0,0,0],
			[0,0,0,0,0],
            [1,0,0,0,1],
			[0,1,1,1,0],

		],
        10=>[ //10
			[0,1,1,1,0],
			[1,0,0,0,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],
		11=>[
			[1,0,0,0,0],
			[0,1,0,0,0],
			[0,0,1,0,0],
			[0,0,0,1,1],
		],
		12=>[
			[0,0,0,1,1],
			[0,0,1,0,0],
			[0,1,0,0,0],
			[1,0,0,0,0],
		],
		13=>[
			[0,0,0,0,0],
			[0,0,0,1,0],
			[1,0,1,0,1],
			[0,1,0,0,0],
		],
		14=>[
			[0,1,0,0,0],
			[1,0,1,0,1],
			[0,0,0,1,0],
			[0,0,0,0,0],
		],
		15=>[
			[1,0,1,0,1],
			[0,1,0,1,0],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],//5
		16=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[0,1,0,1,0],
			[1,0,1,0,1],
		],
		17=>[ //7
			[0,0,0,1,0],
			[1,0,1,0,1],
			[0,1,0,0,0],
			[0,0,0,0,0],
		],
		18=>[ //8
			[0,0,0,0,0],
			[0,1,0,0,0],
			[1,0,1,0,1],
			[0,0,0,1,0],
		],
		19=>[ //9
			[1,0,0,0,1],
			[0,1,1,1,0],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],
        20=>[ //00
			[0,0,0,0,0],
			[0,0,0,0,0],
			[0,1,1,1,0],
			[1,0,0,0,1],
		],
        21=>[ //9
			[0,0,0,0,0],
			[1,1,0,0,0],
			[0,0,1,0,0],
			[0,0,0,1,1],
		],
        22=>[ //00
			[0,0,0,1,1],
			[0,0,1,0,0],
			[1,1,0,0,0],
			[0,0,0,0,0],
		],
        23=>[ //7
			[1,0,0,0,0],
			[0,1,0,0,0],
			[0,0,1,1,0],
			[0,0,0,0,1],
		],
		24=>[ //8
			[0,0,0,0,1],
			[0,0,1,1,0],
			[0,1,0,0,0],
			[1,0,0,0,0],
		],
		25=>[ //9
			[0,0,0,0,0],
			[1,0,0,0,0],
			[0,1,1,1,0],
			[0,0,0,0,1],
		],
        26=>[ //00
			[0,0,0,0,1],
			[0,1,1,1,0],
			[1,0,0,0,0],
			[0,0,0,0,0],
		],
        27=>[ //9
			[1,1,0,1,1],
			[0,0,1,0,0],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],
        28=>[ //00
			[0,0,0,0,0],
			[0,0,0,0,0],
			[0,0,1,0,0],
			[1,1,0,1,1],
		],
        29=>[ //9
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,0,1,1],
			[0,0,1,0,0],
		],
        30=>[ //00
			[0,0,1,0,0],
			[1,1,0,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],
        31=>[ //9
			[1,1,1,0,0],
			[0,0,0,1,0],
			[0,0,0,0,1],
			[0,0,0,0,0],
		],
        32=>[ //00
			[0,0,0,0,0],
			[0,0,0,0,1],
			[0,0,0,1,0],
			[1,1,1,0,0],
		],
        33=>[ //7
			[0,0,0,0,0],
			[0,0,0,0,1],
			[1,0,0,1,0],
			[0,1,1,0,0],
		],
		34=>[ //8
			[0,1,1,0,0],
			[1,0,0,1,0],
			[0,0,0,0,1],
			[0,0,0,0,0],
		],
		35=>[ //9
			[1,0,0,0,0],
			[0,1,1,0,0],
			[0,0,0,1,0],
			[0,0,0,0,1],
		],
        36=>[ //00
			[0,0,0,0,1],
			[0,0,0,1,0],
			[0,1,1,0,0],
			[1,0,0,0,0],
		],
        37=>[ //9
			[0,0,0,0,1],
			[0,0,0,1,0],
			[1,0,1,0,0],
			[0,1,0,0,0],
		],
        38=>[ //00
			[0,1,0,0,0],
			[1,0,1,0,0],
			[0,0,0,1,0],
			[0,0,0,0,1],
		],
        39=>[ //9
			[1,0,0,0,0],
			[0,1,0,0,0],
			[0,0,1,0,1],
			[0,0,0,1,0],
		],
        40=>[ //00
			[0,0,0,1,0],
			[0,0,1,0,1],
			[0,1,0,0,0],
			[1,0,0,0,0],
		],

];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='left';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[6];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[7];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//символ,который запускает бонусы (не фригеймы), используется например в крейзи монкей
$l['bonus']=[];
//запуск бонуса
//первое число - количество бонусов при выпадении 0 бонусных символов на барабане , второе - при выпадении 1 символа  и.т.д
$l['bonus_param']=[0,0,0,0,0,0];
//настройка для бонус игры
$l['bonus_chance']=[];
//дополнительная жизнь в бонус игре
$l['extralife']=[];


//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д


/*
spin_count: 32768
                        in: 20852834100
                        out: 20465681920
                        z: 0.9814
                        bonus: 0 0 0 0 0 0
                        freespin: 0
                        winScatter: 642183680
                        time: 1
                        bars: [2,3,1,0,5,7,4,6]
*/

$l['bars']=[
		1=>[2,2,2,2,3,3,3,3,2,2,2,2,1,1,1,1,3,3,3,3,0,0,0,0,2,2,2,2,5,5,5,5,1,1,1,1,7,4,4,4,4,2,2,2,2,1,1,1,1,2,2,2,2,6,6,6,6,1,1,1,1,0,0,0,0,3,3,3,3,4,4,4,4,2,2,2,2,5,5,5,5,7,1,1,1,1,5,5,5,5,0,0,0,0,3,3,3,3,4,4,4,4
			],
		2=>[1,1,1,1,3,3,3,3,0,0,0,0,4,4,4,4,3,3,3,3,1,1,1,1,4,4,4,4,7,1,1,1,1,2,2,2,2,4,4,4,4,6,6,6,6,2,2,2,2,1,1,1,1,0,0,0,0,5,5,5,5,1,1,1,1,7,3,3,3,3,2,2,2,2,0,0,0,0,5,5,5,5,1,1,1,1,7,0,0,0,0,5,5,5,5,4,4,4,4,2,2,2,2
		],
		3=>[0,0,0,0,4,4,4,4,2,2,2,2,3,3,3,3,0,0,0,0,2,2,2,2,5,5,5,5,1,1,1,1,7,5,5,5,5,3,3,3,3,2,2,2,2,0,0,0,0,1,1,1,1,3,3,3,3,0,0,0,0,7,4,4,4,4,1,1,1,1,0,0,0,0,3,3,3,3,6,6,6,6,4,4,4,4,0,0,0,0,1,1,1,1,5,5,5,5,2,2,2,2,7,3,3,3,3
		],
		4=>[4,4,4,4,2,2,2,2,5,5,5,5,1,1,1,1,2,2,2,2,0,0,0,0,4,4,4,4,3,3,3,3,1,1,1,1,6,6,6,6,2,2,2,2,4,4,4,4,0,0,0,0,5,5,5,5,4,4,4,4,1,1,1,1,2,2,2,2,7,0,0,0,0,1,1,1,1,3,3,3,3,0,0,0,0,5,5,5,5,3,3,3,3,1,1,1,1,7,2,2,2,2,0,0,0,0,
			//Скорее всего нужно добавить в конец 5,5,5,5,4,4,4,4,1,1,1,1,2,2,2,2,7,0,0,0,0  чтобы было три 7 на барабане
			//Если добавить 4,4,4,4,2,2,2,2,5,5,5,5,1,1,1,1,2,2,2,2,0,0,0,0, -  будет 96,76
		],
		5=>[
2,2,2,2,6,6,6,6,6,1,1,1,1,0,0,0,0,3,3,3,3,2,2,2,2,1,1,1,1,3,3,3,3,2,2,2,2,5,5,5,5,6,6,6,6,1,1,1,1,4,4,4,4,2,2,2,2,5,5,5,5,0,0,0,0,7,1,1,1,1,3,3,3,3,7,0,0,0,0,3,3,3,3,2,2,2,2,4,4,4,4,1,1,1,1,2,2,2,2,0,0,0,0,3,1,1,1,0,0,0,0,4,4,4,4,2,2,2,2,5,5,5,5,1,1,1,1,3,3,3,3,0,0,0,0,4,4,4,4,1,1,1,1,5,5,5,5,0,0,0,0,3,3,3,3,1,1,1,1,5,5,5,5,2,2,2,2,4,4,4,4,1,1,1,1
		]
];

$l['bars']=[
		1=>[1,2,6,3,1,6,1,1,6,],
		2=>[3,5,4,1,1,6,1,6,6,],
		3=>[5,3,6,5,1,6,1,1,6,],
		4=>[2,1,2,3,4,5,],
		5=>[1,4,5,6,3,4,5,]
        ];

$l['anypay']=[7];

$l['pay'][0] =[0,0,0,10,20,100]; //0 вишня
$l['pay'][1] =[0,0,0,10,20,100]; //1 апельсин
$l['pay'][2] =[0,0,0,10,20,100]; //2 лимон
$l['pay'][3] =[0,0,0,20,40,200]; //3 слива
$l['pay'][4] =[0,0,0,20,40,200]; //4 арбуз
$l['pay'][5] =[0,0,0,20,80,400]; //5 виноград
$l['pay'][6] =[0,0,0,40,400,1000]; //6  7 красная
$l['pay'][7] =[0,0,0,5,20,500]; //7 звезда желтая


//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets'] = [5,10,15,20,25];

$l['bonus_double'] = 'spin'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша

//требуется для корректного отображения кнопок + возможно есть функциональная завязка на клиенте
$l['staticlines'] = [20];

$l['heigth']=4;

return $l;