<?php
//линии
$l['lines']=[
		1=>[
			[0,0,0,0,0],
			[1,1,1,1,1],
			[0,0,0,0,0],
		],

		2=>[
			[1,1,1,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],

		3=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,1,1,1],
		],

		4=>[
			[1,0,0,0,1],
			[0,1,0,1,0],
			[0,0,1,0,0],
		],

		5=>[
			[0,0,1,0,0],
			[0,1,0,1,0],
			[1,0,0,0,1],
		],//5

		6=>[
			[1,1,0,0,0],
			[0,0,1,0,0],
			[0,0,0,1,1],
		],

		7=>[ //7
			[0,0,0,1,1],
			[0,0,1,0,0],
			[1,1,0,0,0],
		],

		8=>[ //8
			[0,0,0,0,0],
			[1,0,0,0,1],
			[0,1,1,1,0],
		],


		9=>[ //9
			[0,1,1,1,0],
			[1,0,0,0,1],
			[0,0,0,0,0],
		],

        10=>[ //10
			[1,0,0,0,1],
			[0,1,1,1,0],
			[0,0,0,0,0],
		],
		11=>[
			[0,0,0,0,0],
			[0,1,1,1,0],
			[1,0,0,0,1],
		],
		12=>[
			[0,0,0,1,0],
			[1,0,1,0,1],
			[0,1,0,0,0],
		],
		13=>[
			[0,1,0,0,0],
			[1,0,1,0,1],
			[0,0,0,1,0],
		],
		14=>[
			[1,0,1,0,1],
			[0,1,0,1,0],
			[0,0,0,0,0],
		],
		15=>[
			[0,0,0,0,0],
			[0,1,0,1,0],
			[1,0,1,0,1],
		],//5
		16=>[
			[0,0,0,0,0],
			[1,1,0,1,1],
			[0,0,1,0,0],
		],
		17=>[ //7
			[0,0,1,0,0],
			[1,1,0,1,1],
			[0,0,0,0,0],
		],
		18=>[ //8
			[1,0,1,0,1],
			[0,0,0,0,0],
			[0,1,0,1,0],
		],
		19=>[ //9
			[0,1,0,1,0],
			[0,0,0,0,0],
			[1,0,1,0,1],
		],
        20=>[ //10
			[0,1,0,1,0],
			[1,0,0,0,1],
			[0,0,1,0,0],
		],

];

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='left';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[6];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[7];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,0,0,0];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//символ,который запускает бонусы (не фригеймы), используется например в крейзи монкей
$l['bonus']=[];
//запуск бонуса
//первое число - количество бонусов при выпадении 0 бонусных символов на барабане , второе - при выпадении 1 символа  и.т.д
$l['bonus_param']=[0,0,0,0,0,0];
//настройка для бонус игры
$l['bonus_chance']=[];
//дополнительная жизнь в бонус игре
$l['extralife']=[];


//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д

/*
 spin_count: 32768
                        in: 2954952000
                        out: 2841878520
                        z: 0.9617
                        bonus: 0 0 0 0 0 0
                        freespin: 0
                        winScatter: 69866280
                        time: 1
*/

$l['bars']=[
		1=>[4,2,2,2,1,1,1,3,3,3,0,0,0,2,2,2,5,1,1,1,7,4,4,4,2,2,2,5,5,5,7,1,1,1,5,5,5,0,0,0,3,3,3,4,4,4,2,2,2,3,3,3,2,2,2,1,1,1,2,2,2,6,6,6,1,1,1,0,0,0,3,3,3,4,4],
		2=>[1,1,1,7,0,0,0,5,5,5,4,4,4,2,2,2,1,1,1,3,3,3,0,0,0,4,4,4,3,3,3,1,1,1,4,4,4,1,1,1,2,2,2,4,4,4,6,6,6,2,2,2,1,1,1,0,0,0,5,5,5,1,1,1,7,3,3,3,2,2,2,0,0,0,5,5,5],
		3=>[2,2,5,5,5,1,1,1,7,5,5,5,3,3,3,2,2,2,0,0,0,1,1,1,5,5,5,2,2,2,7,3,3,3,0,0,0,4,4,4,2,2,2,3,3,3,0,0,0,4,4,4,1,1,1,0,0,0,3,3,3,6,6,6,4,4,4,0,0,0,1,1,1,3,3,3,0,0,0,2],
		4=>[0,4,4,4,2,2,2,5,5,5,1,1,1,2,0,0,0,4,4,4,3,3,3,1,1,1,6,6,6,2,2,2,4,4,4,0,0,0,5,5,5,4,4,4,1,1,1,2,2,2,7,0,0,0,1,1,1,3,3,3,0,0,0,5,5,5,3,3,3,1,1,1,7,2,2,2,0,0],
		5=>[1,2,2,2,0,0,0,3,3,3,1,1,1,0,0,0,3,3,3,2,2,2,5,5,5,0,0,0,7,1,1,1,3,3,3,2,2,2,6,6,6,1,1,1,4,4,4,2,2,2,5,5,5,1,1,1,3,7,0,0,0,4,4,4,1,1,1,5,5,5,2,2,2,4,4,4,1,1,1,2,2,2]
];
//
$l['anypay']=[7];
/*
$l['pay'][0] =[0,0,0,10,20,100]; //0 вишня
$l['pay'][1] =[0,0,0,10,20,100]; //1 апельсин
$l['pay'][2] =[0,0,0,10,20,100]; //2 лимон
$l['pay'][3] =[0,0,0,20,40,200]; //3 слива
$l['pay'][4] =[0,0,0,20,40,200]; //4 арбуз
$l['pay'][5] =[0,0,0,20,80,400]; //5 виноград
$l['pay'][6] =[0,0,0,40,400,1000]; //6  7 красная
$l['pay'][7] =[0,0,0,5,20,500]; //7 звезда желтая
*/

$l['pay'][0] =[0,0,0,8,16,80]; //0 вишня
$l['pay'][1] =[0,0,0,10,20,100]; //1 апельсин
$l['pay'][2] =[0,0,0,10,24,120]; //2 лимон
$l['pay'][3] =[0,0,0,20,40,200]; //3 слива
$l['pay'][4] =[0,0,0,20,40,200]; //4 арбуз
$l['pay'][5] =[0,0,0,20,100,400]; //5 виноград
$l['pay'][6] =[0,0,0,40,400,1200]; //6  7 красная
$l['pay'][7] =[0,0,0,5,25,500]; //7 звезда желтая


//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets'] = [1, 2, 3, 4, 5];

$l['bonus_double'] = 'spin'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша

//требуется для корректного отображения кнопок + возможно есть функциональная завязка на клиенте
//$l['staticlines'] = [20];

$l['lines_choose']= [20, 15, 10, 5, 1];



$l["barsCert"] = [
1 => [4,2,2,2,1,1,1,3,3,3,0,0,0,2,2,2,5,1,1,1,7,4,4,4,2,2,2,5,5,5,7,1,1,1,5,5,5,0,0,0,3,3,3,4,4,4,2,2,2,3,3,3,2,2,2,1,1,1,2,2,2,6,6,6,1,1,1,0,0,0,3,3,3,4,4],
2 => [1,1,1,7,0,0,0,5,5,5,4,4,4,2,2,2,1,1,1,3,3,3,0,0,0,4,4,4,3,3,3,1,1,1,4,4,4,1,1,1,2,2,2,4,4,4,6,6,6,2,2,2,1,1,1,0,0,0,5,5,5,1,1,1,7,3,3,3,2,2,2,0,0,0,5,5,5],
3 => [2,2,5,5,5,1,1,1,7,5,5,5,3,3,3,2,2,2,0,0,0,1,1,1,5,5,5,2,2,2,7,3,3,3,0,0,0,4,4,4,2,2,2,3,3,3,0,0,0,4,4,4,1,1,1,0,0,0,3,3,3,6,6,6,4,4,4,0,0,0,1,1,1,3,3,3,0,0,0,2],
4 => [0,4,4,4,2,2,2,5,5,5,1,1,1,2,0,0,0,4,4,4,3,3,3,6,6,6,2,2,2,4,4,4,0,0,0,5,5,5,4,4,4,1,1,1,2,2,2,7,0,0,0,1,1,1,3,3,3,0,0,0,5,5,5,3,3,3,1,1,1,7,2,2,2,0,0],
5 => [1,2,2,2,0,0,0,3,3,3,1,1,1,0,0,0,3,3,3,2,2,2,5,5,5,0,0,0,7,1,1,1,3,3,3,2,2,2,6,6,6,1,1,1,4,4,4,2,2,2,5,5,5,1,1,1,3,7,0,0,0,4,4,4,1,1,1,5,5,5,2,2,2,4,4,4,1,1,1,2,2,2],
]; 

return $l;



