<?php


$l['lines']=array(
		1=>[
			[0,0,0,0,0],
			[1,1,1,1,1],
			[0,0,0,0,0],
		],

		2=>[
			[1,1,1,1,1],
			[0,0,0,0,0],
			[0,0,0,0,0],
		],

		3=>[
			[0,0,0,0,0],
			[0,0,0,0,0],
			[1,1,1,1,1],
		],

		4=>[
			[1,0,0,0,1],
			[0,1,0,1,0],
			[0,0,1,0,0],
		],

		5=>[
			[0,0,1,0,0],
			[0,1,0,1,0],
			[1,0,0,0,1],
		],//5

		6=>[ //6
			[1,1,0,0,0],
			[0,0,1,0,0],
			[0,0,0,1,1],
		],

		7=>[ //7
			[0,0,0,1,1],
			[0,0,1,0,0],
			[1,1,0,0,0],
		],

		8=>[
			[0,0,0,0,0],
			[1,0,0,0,1],
			[0,1,1,1,0],
		],

		9=>[ //9
			[0,1,1,1,0],
			[1,0,0,0,1],
			[0,0,0,0,0],
		],
        10=>[ //10
			[1,0,0,0,1],
			[0,1,1,1,0],
			[0,0,0,0,0],
		],
        11=>[
			[0,0,0,0,0],
			[0,1,1,1,0],
			[1,0,0,0,1],
		],
		12=>[
			[0,0,0,1,0],
			[1,0,1,0,1],
			[0,1,0,0,0],
		],
		13=>[
			[0,1,0,0,0],
			[1,0,1,0,1],
			[0,0,0,1,0],
		],
		14=>[
			[1,0,1,0,1],
			[0,1,0,1,0],
			[0,0,0,0,0],
		],
		15=>[
			[0,0,0,0,0],
			[0,1,0,1,0],
			[1,0,1,0,1],
		],//5
);




//-----------------------------------------------------------------------

//порядок оплаты
//left - комбинации считаются слева направо
//right - справа на лево
//any - влюбом месте
//допускает несколько значений пример $l['pay_rule']=['left','right'];
$l['pay_rule']='left';

//символ бесплатных вращений, который запускает фригеймы, если несколько через запятую.
//При указании символа в этой настройке символ не будет выплачиваться при появлении в любом месте, для этого используйте насторойку anypay
$l['scatter']=[9];
//дикий, который заменяет другие символы в комбинациях
$l['wild']=[9];
//множитель выигрыша если в комбинации участвует дикий
$l['wild_multiplier']=1;
//символы, которые не участвуют в комбинации с wild, если несколько указывать через запятую
//настройка действует только на выигрыши в линии
//anypay, фриспины и бонус игра всегда считают без wild, тут их указывать не нужно
$l['wild_except']=[];
//символы, которые выплачиваются в любом месте, работает независимо от настройки scatter.
$l['anypay']=[9];
//количество свободных вращений
//первое число - количество фригеймов при выпадении 0 scatter, второе - при выпадении 1 scatter и.т.д
$l['free_games']=[0,0,0,12,12,12];
//множитель выигрыша в фригеймах
$l['free_multiplier']=1;
//режим накопления в бонус игре при выпадении новых фригеймов
//reset - сброс на начальное значение
//sum - складывается с остатком
$l['free_mode']='sum';
//как ведет себя множитель при выигрыше freespin во время freespin
//simple - остается прежним
//inc - увеличивается на 1
$l['free_multiplier_mode']='simple';

//Символ, на который будет заменяться wild если в комбинации будет участвовать только wild
//С такой настройкой wild может выплачиваться два раза если он является скаттером, также будет выплачиваться линия из 5 wild по цене replaceWild символа
//Поддержка реализована только для $l['pay_rule']='left';
//false для обычный работы
$l['replaceWild']=8;

$l['bonus_chance']=[];
//дополнительная жизнь в бонус игре
$l['extralife']=[];


//таблица выплат
//номер в квадратных скобках перед "=" - номер символа
//первое число - выплата при выпадении 0 символов в линии, второе - при выпадении 1 символа в линии и.т.д
$l['pay'][0] = array( 0, 0, 0, 5, 25, 100 );   //  10
$l['pay'][1] = array( 0, 0, 0, 5, 25, 100 );   //  J
$l['pay'][2] = array( 0, 0, 0, 5, 25, 100 );   //  Q
$l['pay'][3] = array( 0, 0, 0, 5, 40, 150 );   //  K
$l['pay'][4] = array( 0, 0, 0, 5, 40, 150 );  //   A
$l['pay'][5] = array( 0, 0, 5, 30, 100, 750 );  //   гриб
$l['pay'][6] = array( 0, 0, 5, 30, 100, 750 );  // гном
$l['pay'][7] = array( 0, 0, 5, 40, 400, 2000 ); //  баба
$l['pay'][8] = array( 0, 0, 10, 100, 1000, 5000 );//  мужик
$l['pay'][9] = array( 0, 0, 0, 2, 25, 250 );// конь





$l['bars']=[
    1=>[2,7,0,2,1,3,5,0,1,3,7,1,2,3,4,2,1,6,0,4,2,3,1,4,2,0,9,4,1,0,5,4,2,0,8,3,0,6,1,2,0,1],
    2=>[0,1,2,9,4,1,2,7,3,4,1,3,0,1,5,2,4,3,0,7,1,3,4,2,5,0,4,8,1,0,4,1,2,6,0,3,1,0,2,6,3,4,0,2,5,3,4,1,3,6],
    3=>[5,3,4,5,2,4,8,3,0,7,2,3,1,6,2,7,3,1,6,4,0,6,2,3,6,4,1,2,5,0,1,4,9,0,3,7,4,2,5,1,0],
    4=>[5,4,3,8,2,6,3,7,0,2,6,0,3,1,7,4,0,5,2,3,8,4,5,1,4,9,0,1,5,3,0,8,2,4,7,1,2,6,1,3],
    5=>[1,9,3,1,5,3,4,7,2,0,8,3,0,1,5,4,3,5,0,4,1,8,4,1,6,2,4,5,0,1,9,3,1,2,4,5,2,0,7,4,6,2,3,8,0]
];


$l['barFree']=[
    1=>[4,6,0,2,3,9,4,1,5,0,1,3,7,1,0,3,1,7,2,1,3,5,2,0,1,4,8,3,2,1,6,0,3,2,9,0,3],
    2=>[0,2,9,3,0,7,1,4,5,1,0,6,1,4,8,0,4,5,2,0,5,2,4,6,1,2,5,3,2,6,0,3,9,1,4,6,1,4,7,2,0,6,1,4,5],
    3=>[2,5,4,3,9,2,0,4,6,0,1,8,0,2,3,6,4,8,1,3,6,4,1,5,0,3,1,7,0,4,5,2,6,3,0,9,2,4,7,2,3,8,1,2,0,5,4,1],
    4=>[3,2,8,1,4,5,0,2,6,4,1,7,4,3,6,1,2,4,6,3,4,7,1,3,2,6,0,3,5,0,1,9,2,3,0,5,4,0,5,2,1,9,0],
    5=>[3,2,5,1,4,8,3,2,6,1,0,5,4,0,6,3,1,9,2,1,0,3,5,4,0,2,4,3,2,7,3,1,0,6,2,0,7,4,1,8,2,4,9]
];


//в старых играх, а также в deluxe версиях разные параметры
$l['dentab'] = [100];
$l['bets'] = [1, 2, 3, 4, 5];

$l['bonus_double'] = 'spin'; //удвоение бонус игр. spin - удвоение на каждом спине, all - удвоение всего выигрыша

$l['lines_choose']= [15, 10, 7, 5, 1];



$l["barsCert"] = [
1 => [2,7,0,2,1,3,5,0,1,3,7,1,2,3,4,2,1,6,0,4,2,3,1,4,2,0,9,4,1,0,5,4,2,0,8,3,0,6,1,2,0,1],
2 => [0,1,2,9,4,1,2,7,3,4,1,3,0,1,5,2,4,3,0,7,1,3,4,2,5,0,4,8,1,0,4,1,2,6,0,3,1,0,2,6,3,4,0,2,5,3,4,1,3,6],
3 => [5,3,4,5,2,4,8,3,1,7,2,3,1,6,2,7,3,1,6,4,0,6,2,3,6,4,1,2,5,0,1,3,4,9,0,3,5,7,4,2,1],
4 => [5,4,3,8,2,6,3,7,3,2,6,0,3,1,7,4,0,5,2,3,8,4,5,1,4,9,0,1,5,3,0,8,2,4,7,1,2,6,1,3],
5 => [1,9,3,1,5,3,4,7,2,0,8,3,0,1,5,4,3,5,4,3,1,8,4,1,6,2,4,5,0,1,9,3,1,2,4,5,2,0,7,4,6,2,3,8,0],
]; 



 $l["barsFreeCert"] = [
1 => [4,6,0,2,3,9,4,1,5,0,1,3,7,1,0,3,1,7,2,1,3,5,2,0,1,4,8,3,2,1,6,0,3,2,9,0,3],
2 => [0,2,9,3,0,7,1,4,5,1,0,6,1,4,8,0,4,5,2,0,5,2,4,6,1,2,5,3,2,6,0,3,9,1,4,6,1,4,7,2,0,6,1,4,5],
3 => [2,5,4,3,9,2,0,4,6,0,1,8,0,2,3,6,4,8,1,3,6,4,1,5,0,3,1,7,0,4,5,2,6,3,0,9,2,4,7,2,3,8,1,2,0,5,4,1],
4 => [3,2,8,1,4,5,0,2,6,4,1,7,4,3,6,1,2,4,6,3,4,7,1,3,2,6,0,3,5,0,1,9,2,3,0,5,4,0,5,2,1,9,0],
5 => [3,2,5,1,4,8,3,2,6,1,0,5,4,0,6,3,1,9,2,1,0,3,5,4,0,2,4,3,2,7,3,1,0,6,2,0,7,4,1,8,2,4,9],
];


return $l;



